Repository: Xubuntu-Team/xubuntu-docs
Catalog: contributor-docs/po/*.po
Languages: pt_br

source: The most important goal of the testing is to find as many bugs as possible and report them with sufficient detail to the Ubuntu QA trackers. To read more about conducting tests and reporting them, refer to the QA tracker wiki page.
pt_br: O objetivo mais importante dos testes é encontrar tantos bugs quanto possível e relatá-los com detalhes suficientes para os rastreadores do controle de qualidade do Ubuntu. Para ler mais sobre conduzir testes e relatá-los, refira-se a página da wiki do rastreador de controle de qualidade.

source: ISO testing
pt_br: Teste da ISO

source: The Xubuntu team will do its best to ensure that released milestone ISOs have enough tests completed. We will also test daily builds, upgrading through supported release paths and running the development version regularly to help detect problems and make sure the changes made meet the release goals, work as expected and do not cause regressions.
pt_br: A equipe do Xubuntu fará o seu melhor para garantir que as ISOs de marco lançadas tenham completado testes o bastante. Nós também iremos testar builds diárias, atualizando através do canal de versões suportadas e executando a versão de desenvolvimento regularmente para ajudar a detectar problemas e garantir que as alterações atinjam as metas de lançamento, funcionem como o esperado e não causem regressões.

source: The following schedule is used for daily testing:
pt_br: O seguinte horário é usado para testes diários:

source: Scheduled time
pt_br: Horário agendado

source: Action
pt_br: Ação

source: Beginning of cycle
pt_br: Começo do ciclo

source: Send testing schedule via both the developer and users mailing lists as well as the Launchpad testing team.
pt_br: Envie o horário de testes através de ambas as listas de e-mail do desenvolvedor e do usuário assim como a da equipe de testes do Launchpad.

source: Monthly
pt_br: Mensalmente

source: As required, send out reminders of the testing schedule.
pt_br: Como requerido,envie lembretes do horário de testes.

source: The following schedule is used for each milestone:
pt_br: O seguinte horário é usado para cada marco:

source: 7 days before release
pt_br: 7 dias antes do lançamento

source: Pre-reminder for milestone testing
pt_br: Pré-lembrete para testes de marco

source: 2 to 3 days before release
pt_br: 2 a 3 dias antes do lançamento

source: Once appropriate testing area set up, call for testing and start milestone testing
pt_br: Uma vez configurada a área de testes apropriada, peça por testes e inicie os testes de marco

source: Release day
pt_br: Dia de lançamento

source: Mark images ready on the ISO tracker once the release team is confident to do so
pt_br: Marque imagens prontas no rastreador da ISO uma vez que a equipe de lançamentos esteja confiante para fazer isso

source: Package testing
pt_br: Testes de pacotes

source: When being used the QA team will schedule package testing sprints to happen during the cycle between milestone testing to ensure applications that are included in Xubuntu have sufficient amount of testing conducted.
pt_br: Quando sendo usado a equipe de controle de qualidade irá agendar um sprint de testes de pacotes durante o ciclo entre testes de marcos para garantir que os aplicativos que são incluídos no Xubuntu tenham passado por testes o suficiente.

source: Regardless of whether package testing is taking place during a development cycle, additional testing should be conducted for a new default application is to be included in the next Xubuntu release, when an existing application has a substantially large update in the middle of the cycle or when developers request specific testing for a specific update to an application.
pt_br: Independentemente de um teste de pacote estar sendo realizado durante um ciclo de desenvolvimento, testes adicionais devem ser conduzidos para um novo aplicativo padrão ser incluído na próxima versão do Xubuntu, quando um aplicativo existente tem uma atualização consideravelmente grande no meio do ciclo ou quando os desenvolvedores solicitarem testes específicos para uma atualização específica de um aplicativo.

source: Calls for package testing sprints will be sent out as required.
pt_br: Chamadas para sprints de testes de pacotes serão enviadas como requerido.

source: Releasing
pt_br: Lançando

source: When it comes time to deploy a release (both milestones and final) several conditions must be met:
pt_br: Quando chegar a hora de disponibilizar um lançamento (ambos marcos e finais) várias condições devem ser atendidas:

source: Appropriate testing has been done on the image
pt_br: Testes apropriados foram feitos na imagem

source: There are no known bugs which cause data loss or damage to hardware
pt_br: Não há bugs conhecidos que causem perda de dados ou dano ao hardware

source: The image must not be oversized
pt_br: A imagem não deve ser superdimensionada

source: Xubuntu must be of sufficient quality that it would not damage Xubuntu's, Ubuntu's, or any of the other flavors' reputation/image.
pt_br: Xubuntu deve ser de qualidade suficiente para que não danifique a reputação e imagem do Xubuntu,Ubuntu, ou a de qualquer outra flavour.

source: When a release is made, the Xubuntu Release Team must follow the release process specified below. The release process ensures that the new release has sufficient release notes and release announcement and that all release-specific communication is updated to inform about the new release. Where needed, advice from the Ubuntu release team should be asked for.
pt_br: Quando um lançamento é feito, a equipe de lançamento do Xubuntu deve seguir o processo de lançamento especificado abaixo. O processo de lançamento garante que o novo lançamento tenha notas de lançamento suficientes e que o anúncio de lançamento e toda a comunicação específica de versão está atualizada para informar sobre a nova versão. Quando necessário, deve-se pedir conselhos a equipe de lançamento do Ubuntu.

source: User Interface Freeze
pt_br: Freeze da interface do usuário

source: Upload artwork and slideshow packages
pt_br: Enviar pacotes de ilustrações e slideshow

source: Documentation String Freeze
pt_br: Freeze da String de documentação

source: Update translation templatesUpload documentation packages
pt_br: Atualizar modelos de tradução enviar pacotes de documentação

source: Non-Language Pack Translation Deadline
pt_br: Prazo final de tradução de pacote sem idioma

source: Upload documentation and slideshow packages
pt_br: Enviar pacotes de documentação e slideshow

source: 14 days before release
pt_br: 14 dias antes do lançamento

source: Reminder to update the website FAQ (final release only)
pt_br: Lembrete para atualizar o perguntas frequentes do website (apenas versão final)

source: Start preparing release notes and release announcementMake the tracker start tracking the next release
pt_br: Começar a preparar notas de lançamento e anúncio do lançamento Fazer o rastreador começar a rastrear o próximo lançamento

source: Publish release announcement and notesUpdate the website, IRC channel topics and social media outlets with new release information
pt_br: Publicar anúncio de lançamento e notas atualizar o website, tópicos do canal IRC e meios de comunicação social com informações da nova versão

source: After release (final release only)
pt_br: Após o lançamento (apenas versão final)

source: Set the new development version as the default in the trackerSet up appropriate branches (documentation, ...) in LaunchpadReview and update this page
pt_br: Defina a nova versão de desenvolvimento como a padrão no configurar branches apropriadas do rastreador (documentation, ...) em LaunchpadReview e atualize esta página

source: Maintaining
pt_br: Mantendo

source: After a release is made, bugs and problems are bound to be reported. The period between the release and the start of the next release cycle is the optimal time to perform Stable Release Updates (SRU) for major bugs as long as developers do not forget to fix the issue in the next release as well, once the repository opens. Once the next release cycle has started, primary focus will be on the next release and the severity/importance of the SRU candidates will be more important when it comes to deciding whether an SRU will be performed or not.
pt_br: Após um lançamento ser feito,é certo que bugs e problemas serão relatados. O período entre o lançamento e o início do próximo ciclo de desenvolvimento é o momento ideal para performar Stable Release Updates (SRU) para bugs significativos contanto que os desenvolvedores não esqueçam de consertar o problema na próxima versão também, uma vez que o repositório abra. quando o próximo ciclo de lançamento é iniciado, o foco primário será na próxima versão e a gravidade/importância dos SRU candidatos será mais importante ao decidir se um SRU será efeituado ou não.

source: Processes
pt_br: Processos

source: This section describes some of the community processes for Xubuntu development. The processes should be used as guidelines: the main goal of this section is to describe <emphasis>what we do</emphasis>, not so much to describe <emphasis>what we should do</emphasis>.
pt_br: Esta seção descreve alguns dos processos de comunidade para o desenvolvimento do Xubuntu. Os processos devem ser usados como diretrizes: o objetivo principal desta seção é descrever <emphasis>o que nós fazemos</emphasis>,não tanto para descrever <emphasis>o que nós devemos fazer</emphasis>.

source: In addition to the Xubuntu processes described below, there are several generic Ubuntu processes that are useful for the team and described elsewhere:
pt_br: Além dos processos do Xubuntu descritos abaixo, há vários processos genéricos do Ubuntu que são úteis para o time e são descritos em outro lugar:

source: <ulink url="https://wiki.ubuntu.com/FreezeExceptionProcess">Freeze exception process</ulink> for getting to upload changes after a relevant freeze
pt_br: <ulink url="https://wiki.ubuntu.com/FreezeExceptionProcess">Freeze do processo de excessão</ulink> para a capacidade de enviar alterações após um freeze relevante

source: <ulink url="https://wiki.ubuntu.com/SponsorshipProcess">Sponsorship process</ulink> for getting new package uploads in the archive
pt_br: <ulink url="https://wiki.ubuntu.com/SponsorshipProcess">Processo de Patrocinador</ulink> para a capacidade de enviar novos pacotes ao arquivo

source: Meetings
pt_br: Reuniões

source: Chairing a meeting
pt_br: Presidindo uma reunião

source: The community meetings are held in <literal>#xubuntu-devel</literal> and chaired by the Xubuntu team leads. The chairing team leader is cycled based on the team name. The actual upcoming chair list can be found in the comments of the Meetings page.
pt_br: As reuniões comunitárias são realizadas em <literal>#xubuntu-devel</literal> e presididas pelas lideranças de equipe do Xubuntu. O líder de equipe presidindo passa por um ciclo baseado no nome da equipe. A próxima lista de líderes vigente pode ser encontrada nos comentário da página de reuniões.

source: The chair is responsible for scheduling and announcing the meeting on the development mailing list, and for updating the wiki with the meeting time.
pt_br: O líder é responsável pelo agendamento e anúncio da reunião na lista de e-mails de desenvolvimento, e por atualizar a wiki com a hora da reunião.

source: During any of the sections in the meeting, the chair can assign action items to individuals or teams with their permission. The chair should take care to copy these items to blueprint work items where applicable.
pt_br: Durante qualquer seção na reunião,o líder pode atribuir items de ação a indivíduos ou equipes com a sua permissão. O líder deverá tomar conta de copiar esses items para diagramas de items de trabalho onde aplicável.

source: The meeting minutes will need to be added to the wiki after the meeting has ended. To do this, go to the <ulink url="https://wiki.ubuntu.com/Xubuntu/Meetings/Archive/Minutes/">Minutes startpage</ulink> and use the input box for creating a minutes page. You will get the content for the page directly from meetingology Moin output URL.
pt_br: Os minutos da reunião devem ser adicionados a wiki após o fim da reuniao. Para fazer isso,vá para a <ulink url="https://wiki.ubuntu.com/Xubuntu/Meetings/Archive/Minutes/">página ínicial de minutos </ulink>e use a caixa de entrada para criar uma página de minutos. Você receberá o conteúdo para a página diretamente da URL meetingology Moin output.

source: After you have created a minutes page, don't forget to update the include in <ulink url="https://wiki.ubuntu.com/Xubuntu/Meetings/">the Meetings main page</ulink>.
pt_br: Após criar uma página de minutos, não esqueça de atualizar a inclusão do <ulink url="https://wiki.ubuntu.com/Xubuntu/Meetings/"> na página principal de reuniões </ulink>.

source: Website updates
pt_br: Atualizações do website

source: Update on release
pt_br: Atualização no lançamento

source: Update screenshots on the <ulink url="http://xubuntu.org/screenshots/">Screenshots</ulink> page
pt_br: Atualizar capturas de tela na <ulink url="http://xubuntu.org/screenshots/">página</ulink>de Capturas de tela

source: Rotate the <ulink url="http://xubuntu.org/press/">In the Press</ulink> section
pt_br: Alternar a seção <ulink url="http://xubuntu.org/press/">Na Imprensa</ulink>

source: Add new release to the <ulink url="http://xubuntu.org/help/">Help &amp; Support</ulink> and <ulink url="http://xubuntu.org/getxubuntu/">Get Xubuntu</ulink> pages
pt_br: Adicionar nova versão a <ulink url="http://xubuntu.org/help/">Ajuda &amp; Suporte</ulink>e <ulink url="http://xubuntu.org/getxubuntu/">Obtenha Xubuntu </ulink>páginas

source: Change front page widget to point to a new release
pt_br: Altere a ferramenta da página frontal para apontar ao novo lançamento

source: When one is set, remove the widget mentioning testing from the front page
pt_br: Quando um está definido, remova a ferramenta mencionando testes da página frontal

source: When one is prepared, release a FAQ blog article
pt_br: Quando um está preparado, disponibilize um artigo de blog de perguntas frequentes

source: Update on point releases
pt_br: Atualização sobre lançamentos pontuais

source: Update download links on the <ulink url="http://xubuntu.org/getxubuntu/">Get Xubuntu</ulink> page
pt_br: Atualizar links de download na página <ulink url="http://xubuntu.org/getxubuntu/">Obtenha Xubuntu</ulink>

source: Update the front page widget
pt_br: Atualizar a ferramente da página frontal

source: Update on release EOL
pt_br: Atualizar no fim de vida da versão

source: Update the supported releases list on the <ulink url="http://xubuntu.org/help/">Help &amp; Support</ulink> page
pt_br: Atualizar a lista de versões suportadas na página <ulink url="http://xubuntu.org/help/">Help &amp; Support</ulink>

source: Update the <ulink url="http://docs.xubuntu.org/">documentation subdomain</ulink> from <literal><inlinemediaobject role="icon-branch"><imageobject><imagedata role="icon-pad" fileref="../../libs-common/images/icon_branch.png"/></imageobject></inlinemediaobject>lp:xubuntu-website/docs-startpage</literal>
pt_br: Atualize o <ulink url="http://docs.xubuntu.org/">subdomínio da documentação </ulink> de <literal><inlinemediaobject role="icon-branch"><imageobject><imagedata role="icon-pad" fileref="../../libs-common/images/icon_branch.png"/></imageobject></inlinemediaobject>lp:xubuntu-website/docs-startpage</literal>

source: Dealing with bugs
pt_br: Lidando com bugs

source: Using tags for Xubuntu bug reports
pt_br: Usando tags para reportar bugs do Xubuntu

source: So that we can easily find bugs for Xubuntu during a development cycle, there a few tags you can add to your bug reports. We assume that a tag for the cycle codename is included, if it is not please add one.
pt_br: Para que possamos facilmente encontrar bugs do Xubuntu durante um ciclo de desenvolvimento, há algumas tags que você pode adicionar aos seus relatórios de bug. Nós assumimos que uma tag para o codinome do ciclo está incluída,caso não esteja por favor adicione uma.

source: ppa: add this tag when you've reported a bug against a package from one of the 3 develeopment PPAs
pt_br: ppa: adicione esta tag quando tiver relatado um bug contra um pacote de um dos 3 PPAs de desenvolvimento

source: usability: add this tag if the issue you are reporting is not a standard bug, but one which might be deemed wishlist, such as multiple selection of results in the Catfish results window
pt_br: usabilidade: adicione esta tag se o problema que você está relatando não é um bug comum, but um que pode ser considerado na lista de desejos,como seleções múltiplas de resultados da janela de resultados Catfish

source: Normal bug reporting
pt_br: Reportando bug normal

source: Anybody using Xubuntu can file (or in other words, report) bugs, even with no experience at all. Filing bugs is important because in some cases, bugs can go unnoticed unless an end user files them.
pt_br: Qualquer um usando Xubuntu pode registrar (ou em outras palavras,relatar) bugs, mesmo tendo nenhuma experiência. Reportar bugs é importante pois em alguns casos, bugs podem passar despercebidos a menos que um usuário os registre.

source: existing bug reports
pt_br: reportes existentes de bugs

source: bug reporting guidelines
pt_br: diretrizes de reporte de bugs

source: Before submitting a bug, you should look at the <_:ulink-1/> and release notes to verify the bug hasn’t been reported already. If the bug has not already been reported, you should file a new bug report. It is sensible to read through the <_:ulink-2/> before filing your first bug.
pt_br: Antes de enviar um bug, você deverá olhar em <_:ulink-1/>e nas notas de lançamento para verificar se o bug já não foi relatado. Se o bug já não foi relatado,você deve registrar um novo reporte de bug. É sensato ler <_:ulink-2/>antes de registrar o seu primeiro bug.

source: finding the right package
pt_br: Encontrando o pacote certo

source: In the most situations, it is easiest to file a bug by opening a new Terminal and type ubuntu-bug package-name, where package-name is the package you want to file bug against. If you don’t know which package you should file the bug against, refer to the instructions on <_:ulink-1/>. When filing the bug, it is better to have too much information than too little.
pt_br: Na maioria das situações,é mais fácil registrar um bug abrindo um terminal e digitando ubuntu-bug nome-pacote,onde nome-pacote é o pacote que você registrar um bug contra. Se não souber qual pacote você deve registrar um bug contra, refira-se ás instruções em <_:ulink-1/>. Ao registrar o bug,é melhor ter informação demais do que pouca informação.

source: If you are unsure of the package name to report against, you can use your mouse to click on the application window; in a terminal run <_:userinput-1/>, click to close the message window and then click on the application window.
pt_br: Se não tiver certeza do nome de pacote a relatar, você pode usar o seu mouse para clicar na janela de aplicação; em um terminal execute <_:userinput-1/>, clique para fechar a mensagem de janela e então clique na janela da aplicação.

source: Reporting bugs with PPAs
pt_br: Reportando bugs com PPAs

source: When you encounter a bug with a package from a PPA, you’ll need to file the bug report manually. Once you’ve got the offending package name, go to <_:literal-1/>.
pt_br: Quando encontrar um bug em um pacote de PPA. você precisará registrar o relato de bug manualmente. Quando tiver o nome do pacote faltoso, vá para <_:literal-1/>.

source: Crash logs related to the package can be found in <_:literal-1/>. This directory sometimes requires superuser (<_:literal-2/>) permissions to view and extract the contents. These logs can be particularly valuable to include in your bug report, but be sure to review them as they may contain sensitive or personally identifiable material.
pt_br: Registros de falhas do pacote podem ser encontrados em <_:literal-1/>. Este diretório as vezes requer permissões administrador(<_:literal-2/>) para ver e extrair os conteúdos. Esses registros podem ser particularmente valiosos no seu relato de bug, mas tenha certeza de revisá-los pois podem conter material sensível ou pessoalmente identificável.

source: Be sure to follow the above general guidelines, and also add the ppa tag so it is clear to developers that this is an unsupported package.
pt_br: Tenha certeza de seguir as diretrizes gerais acima,e também adicione a tag ppa para tornar claro aos desenvolvedores que esse é um pacote não suportado.

source: Triaging bugs
pt_br: Triagem de bugs

source: triaging bugs
pt_br: triagem de bugs

source: Triaging bugs is getting bug reports in a state where they are useful for developers by making sure bug reports have useful titles, descriptions, appropriate logs and more. To get started, read the page on <_:ulink-1/> in the Ubuntu wiki.
pt_br: Triagem de bugs é receber relatórios de bugs em um estado quando são úteis aos desenvolvedores por garantir que relatórious de bugs tenham títulos úteis, descrições, registros apropriados e mais. Para começar,leia a página <_:ulink-1/>da Ubuntu wiki.

source: Xubuntu bugs
pt_br: Bugs do Xubuntu

source: Ubuntu Bug Control
pt_br: Controle de Bugs do Xubuntu

source: After you have made yourself familiar with the aspects of triaging bugs, you can start triaging <_:ulink-1/>. Please note that the bug status and importance can only be changed by members of the <_:ulink-2/> team #8211 in the beginning, you will need to report triaged bugs for the team in #ubuntu-bugs on Libera. After you have demonstrated your ability to triage bugs, you will gain more responsibilities from the Bug Control team.
pt_br: Após familiarizar-se com os elementos da classificação de bugs, poderá iniciar a classificação <_:ulink-1/>. Favor observar que o status do bug e importância podem ser alterados apenas pelos membros da <_:ulink-2/>equipe#8211 no início,você precisará relatar bugs classificados para a equipe em #ubuntu-bugs no Libera. Após demonstrar a sua habilidade de classificar bugs,você irá ganhar mais responsabilidades da equipe de Controle de Bugs.

source: As you gain experience on triaging Xubuntu bugs, you may want to take a look at new bugs that mention Xubuntu. Triaging new bugs is recommended for those who are more familiar with both triaging and Xubuntu generally, since not all of the new bugs mentioning Xubuntu are actually Xubuntu bugs.
pt_br: Conforme você ganha experiência ao classificar bugs do Xubuntu, você pode querer dar uma olhada em novos bugs que mencionam o Xubuntu. Classificar novos bugs é recomendado aqueles que estão mais familiarizados com a classificação e o Xubuntu geralmente, já que nem todos os novos bugs mencionando Xubuntu são verdadeiramente bugs do Xubuntu.

source: Forwarding bugs upstream
pt_br: Encaminhando bugs ao upstream

source: When bugs are forwarded upstream, all users of the relevant software will benefit from the debugging, triaging and patching work carried out by bug triagers and developers.
pt_br: Quando bugs são encaminhados ao upstream, todos os usuários do software relevante se beneficiarão do trabalho de depuração,classificação,e correção feito pelos classificadores de bugs e desenvolvedores.

source: Xfce bug tracker
pt_br: rastreador de bugs do Xfce
