Repository: Xubuntu-Team/xubuntu-docs
Catalog: contributor-docs/po/*.po
Languages: pt_br

source: Once it has been determined that a bug is not caused by a change in Xubuntu, bugs can be forwarded to their respective upstream projects to be reviewed. For example, all appropriate Xfce bugs should be filed in the <_:ulink-1/>. In addition, to track the status of the bug in Ubuntu, the bug in Launchpad should be linked with the upstream bug.
pt_br: Ao ser determinado que um bug não é causado por uma alteração no Xubuntu, bugs podem ser encaminhados ao upstream de seus respectivos projetos para serem analisados. Por exemplo, todos os bugs apropriados do Xfce devem ser registrados no <_:ulink-1/>. Além disso, para rastrear o status de um bug no Ubuntu, o bug no Launchpad deve ser vinculado ao bug no upstream.

source: forwarding bugs upstream
pt_br: encaminhando bugs ao upstream

source: Bugs/Watches
pt_br: Bugs/Vigias

source: The Ubuntu wiki has an extensive page on <_:ulink-1/> along with instructions on how to report bugs in the upstream bug trackers. Detailed information on the way to add an upstream bug to Launchpad can be found on the <_:ulink-2/> page on the Ubuntu wiki.
pt_br: A Ubuntu Wiki tem uma página extensiva em <_:ulink-1/> juntamente com instruções sobre como relatar bugs nos rastreadores de bug upstream. Informação detalhada na forma de como adicionar um bug do upstream no Launchpad pode ser encontrado na página <_:ulink-2/> da Ubuntu wiki.

source: Testing Infrastructure
pt_br: Infraestrutura de teste

source: Getting ready to test
pt_br: Preparando-se para testar

source: To successfully test for Xubuntu, you will need at a minimum 4 things: a Launchpad account, mailing list subscription, an image and something to test it on. This page will give you the basic information in order to do those things and more.
pt_br: Para testar o Xubuntu com sucesso,você irá precisar no mínimo de 4 coisas: uma conta Launchpad, inscrição na lista de e-mails,uma imagem e algo para testá-la. Esta página irá dar a você as informações básicas para fazer essas coisas e mais.

source: Contacts
pt_br: Contatos

source: You need a Launchpad account, in order to join the necessary team(s) on it, and log into the 2 QA trackers.
pt_br: Você precisa de uma conta Launchpad,para se unir a(s) equipes necessárias nele,e logar nos 2 rastreadores do controle de qualidade.

source: Mailing
pt_br: Postagem

source: We use one mailing list to detail what we intend to test during a cycle, we use the same list when we are calling for tests. This list is also used by the team to discuss the development of Xubuntu. You will need to join the Xubuntu Devel <_:ulink-1/> list.
pt_br: Nós usamos uma lista de e-mails para detalhar o que pretendemos testar durante um ciclo, usamos a mesma lista na chamada para testes. Essa lista também é usada pela equipe para discutir o desenvolvimento do Xubuntu. Você precisará se unir a lista <_:ulink-1/>Xubuntu Devel.

source: development
pt_br: desenvolvimento

source: While it is not necessary to do so, we make much use of IRC, so having an account you can use to access the main #xubuntu-devel channel will help you, alternatively you can access the channel via the IRC tab of the Xubuntu <_:ulink-1/> tracker.
pt_br: Embora não seja necessário fazê-lo, fazemos muito uso do IRC, então tendo uma conta você poderá usá-la para cessar o principal canal #xubuntu-devel para lhe ajudar, alternativamente você pode acessar o canal através da aba IRC do rastreador do Xubuntu <_:ulink-1/>.

source: Join the Xubuntu Testers <_:ulink-1/> team.
pt_br: Se junte a equipe de Testadores do Xubuntu <_:ulink-1/>.

source: Hardware
pt_br: Equipamento

source: Consider adding your details to the <_:ulink-1/> page. We can use this data to request specific testing from specific testers.
pt_br: Considere adicionar os seus detalhes a página <_:ulink-1/>. Podemos usar essa informação para solicitar testes específico de testadores específicos.

source: Getting the ISO
pt_br: Obtendo a ISO

source: ISOs can be obtained through a few methods. The simplest method is to visit the <_:ulink-1/> tracker. Follow the testcases through release codename to Xubuntu's group of tests. Then choose either 64 or 32 bit. Download links are available there.
pt_br: ISOs podem ser obtidas através de alguns métodos. O método mais simples é visitar o rastreador <_:ulink-1/>. Siga os casos de testes através do codinome de lançamento para o grupo de testes do Xubuntu. Então escolha entre 64 ou 32 bits. Links de download estão disponíveis lá.

source: When testing more regularly, you might find (especially where bandwidth is an issue for you) using the <_:ulink-1/> link more appropriate. This is will just grab the difference between your local copy and the current one.
pt_br: Ao testar mais regularmente, você pode achar o uso do link <_:ulink-1/> mais apropriado(especialmente quando a largura de banda é um problema). Ele irá apenas puxar a diferença entre a sua cópia local e a atual.

source: Methods of testing
pt_br: Métodos de teste

source: Now you've set up your basic contact(s) and have your ISO, you are in a position to test it.
pt_br: Agora que configurou o(s) seus contatos básicos e tem a sua ISO, você está numa posição de testá-la.

source: There are two main methods of testing the ISO:
pt_br: Existem dois métodos principais para testar a ISO:

source: Using a virtual machine enables you to carry on using a normal release when testing our ISOs. You can install a virtual machine by directly using your downloaded ISO.
pt_br: Usar uma máquina virtual lhe possibilita a continuar usando uma versão normal quando estiver testando as nossas ISOs. Você pode instalar uma máquina virtual usando diretamente a sua ISO baixada.

source: Install the ISO to hardware where that possibility is available. This is more important towards the end of the development cycle. You will necessarily need to have the ISO in some bootable medium. A member of Xubuntu's Website team details a simple method for preparing a bootable <_:ulink-1/> stick with GNOME Disks.
pt_br: Instale a ISO em hardware onde essa possibilidade está disponível. Isso é mais importante no final do ciclo de desenvolvimento. Você irá precisar de ter a ISO em alguma mídia inicializável. Um membro da equipe do Website do Xubuntu detalha um método simples para preparar um drive bootável <_:ulink-1/> com GNOME Discos.

source: While it is possible to use VirtualBox, past experience has shown that issues found when testing in VirtualBox are hard to replicate elsewhere. You might want to look into using <_:ulink-1/>. Members of Xubuntu QA have some experience with using this for testing and can help.
pt_br: Embora seja possível usar VirtualBox, experiências anteriores demonstraram que problemas encontradas durante os testes no VirtualBox são difíceis de replicar em outro lugar. Você pode querer usar <_:ulink-1/>. Membros da equipe de controle de qualidade do Xubuntu possuem experiência com o uso disso para testes e podem ajudar.

source: Reporting your result
pt_br: Reportando seu resultado

source: There are two QA trackers we use.
pt_br: Existem dois rastreadores de QA que usamos.

source: The ISO tracker mentioned above for any testing done with an ISO either an install or an upgrade test.
pt_br: O rastreador de ISO mencionado acima para qualquer teste feito com uma ISO através de uma instalação ou teste de atualização.

source: Package
pt_br: Pacote

source: The <_:ulink-1/> tracker, which is used when we are testing applications during a cycle.
pt_br: O rastreador <_:ulink-1/>,que é usado quando estamos testando aplicativos durante um ciclo de desenvolvimento.

source: These trackers form the backbone of what we are able to gain from your testing. It is important that you report your results.
pt_br: Esses rastreadores formam o suporte principal do que nós somos capazes de ganhar dos seus testes. É importante que você relate os seus resultados.

source: The next two sections of these documents go into more detail on how you can test for us and how to report bugs for us.
pt_br: As próximas duas seções desses documentos vão entrar em mais detalhes sobre como você pode testar para nós e como relatar bugs para nós.

source: Package and ISO Testing
pt_br: Teste de pacote e ISO

source: current
pt_br: atual

source: In general, links for specific ISOs for daily or milestone use can be found at the <_:ulink-1/>. A link exists for the <_:ulink-2/> development daily ISO. This can be useful, especially when setting up methods to download your testing ISO, such as with <_:ulink-3/>
pt_br: Em geral,links para ISOs específicas para uso diário ou de marco podem ser encontradas em <_:ulink-1/>. Um link existe para a ISO de desenvolvimento diário <_:ulink-2/>. Isso pode ser útil, especialmente quando estiver configurando métodos para testar suas ISOs,como em <_:ulink-3/>

source: QA Status
pt_br: Status do controle de qualidade

source: You can find the last known boot and installation status of our ISOs at <_:ulink-1/> of the development status tracker
pt_br: Você pode encontrar o último estado de instalação e inicialização conhecido de nossas ISOs em <_:ulink-1/>do rastreador de status de desenvolvimento

source: Exploratory Testing
pt_br: Teste exploratório

source: In addition to testing the images and software with predefined testing actions (static testing), community members can take part in exploratory testing as well.
pt_br: Além de testar as imagens e o software com ações de teste predefinidas (testes estáticos), os membros da comunidade também podem participar em testes exploratórios.

source: In essence, exploratory testing means running the development release and doing your daily tasks with the system and finally, filing bugs when you find them. This allows Xubuntu to get a much larger spread of testing than is possible with predefined tests.
pt_br: Em essência, testes exploratórios significa executar a versão de desenvolvimento e fazer suas tarefas diárias com o sistema e, finalmente, arquivar bugs quando você encontrá-los. Isso permite que o Xubuntu obtenha uma propagação muito maior do que é possível com testes pré-definidos.

source: A useful way to deal with this is dual (or multiple) boots. By dual (or multiple) booting you can ensure you are able to access at all times a working version while testing the development system. In this way you can do as much work in the development release as is practical – all the while watching for bugs and regressions in the development release.
pt_br: Uma maneira útil de lidar com isso é dual (ou múltiplos) inicializações. Por meio de inicialização dupla (ou múltipla), você pode garantir que você possa acessar sempre a versão de trabalho ao testar o sistema de desenvolvimento. Desta forma, você pode fazer tanto trabalho na versão de desenvolvimento como é prático - enquanto procura por erros e regressões na versão de desenvolvimento.

source: Manual Partitions and Bootloader location
pt_br: Partições manuais e localização do carregador de inicialização

source: When dual (or multiple booting) it can be helpful to install the bootloader to specific partitions, a simple run-through on addressing this can be found at <_:ulink-1/>.
pt_br: Quando estiver fazendo dual(ou múltiplo boot) pode ser útil instalar o carregador de inicialização em partições específicas,uma simples leitura rápida abordando isso pode ser encontrada em <_:ulink-1/>.

source: Issues which the development team are keen to address include, in addition to normally reported issues, usability bugs, missing icons, inconsistent functionality.
pt_br: As questões que a equipe de desenvolvimento está interessada em incluir incluem, além de problemas normalmente reportados, erros de usabilidade, ícones ausentes, funcionalidades inconsistentes.

source: Using Development PPAs
pt_br: Usando PPAs de desenvolvimento

source: We have 3 PPAs which we use regularly to test packages. These are:
pt_br: Nós temos 3 PPAs que usamos regularmente para testar pacotes. Esses são:

source: Shimmer Themes
pt_br: Temas do Shimmer

source: <_:ulink-1/> for daily builds of the Shimmer Project’s projects
pt_br: <_:ulink-1/>Para builds diárias dos projetos do Projeto Shimmer

source: Xubuntu daily builds
pt_br: builds diárias do Xubuntu

source: <_:ulink-1/> for daily Git and Bzr builds for packages related to Xubuntu and/or Xfce4
pt_br: <_:ulink-1/>para builds diárias Git e builds Bzr para pacotes relacionados ao Xubuntu e/ou Xfce4

source: Xubuntu QA Experimental
pt_br: Controle de qualidade experimental do Xubuntu

source: <_:ulink-1/> for packages and package versions that are being prepared for inclusion in Xubuntu, uploaded for the convenience of people testing these new package versions and features in an otherwise stable environment
pt_br: <_:ulink-1/>Para pacotes e versões de pacotes que estão sendo preparados para inclusão no Xubuntu, enviado para a conveniência de pessoas testando essas novas versões de pacotes e funções em um ambiente normalmente estável.

source: Xubuntu QA Staging
pt_br: Preparação do controle de qualidade do Xubuntu

source: <_:ulink-1/> for testing of packages in released and current Xubuntu versions
pt_br: <_:ulink-1/>Para testes de pacotes nas versões lançadas e atuais do Xubuntu

source: At times the development team use other PPAs to test specific packages. Details of these will be made known to testers when appropriate
pt_br: Às vezes, a equipe de desenvolvimento usa outros PPAs para testar pacotes específicos. Detalhes disso serão divulgados aos testadores quando apropriado.

source: Installing from these PPAs means that you will be using and testing packages that developers are currently working with, this means that regressions found by you will not be present once they are released.
pt_br: Instalar a partir desses PPAs significa que você estará usando e testando pacotes com os quais os desenvolvedores estão trabalhando atualmente, isso quer dizer que as regressões encontradas por você não estarão presentes quando eles forem lançados.

source: Removing an in use PPA. Using ppa-purge causes apt to disable a PPA source list and then change affected packages back to the default versions.
pt_br: Removendo um PPA em uso. O uso de ppa-purge provoca a desativação de uma lista de fontes PPA e, em seguida, altere os pacotes afetados de volta às versões padrão.

source: Run <_:userinput-1/>
pt_br: Execute <_:userinput-1/>

source: Reporting bugs with PPAs can be problematic, please see further information on reporting bugs with PPAs in <_:xref-1/>.
pt_br: Relatando bugs com PPAs pode ser problemático, por favor veja mais informações sobre como relatar bugs com PPAs em <_:xref-1/>.

source: Static Testing
pt_br: Teste Estático

source: Testing the development versions of Xubuntu and packages in it helps keep up the every day quality. If you have spare hardware resources or are able to run a virtualized testing environment, you can help.
pt_br: Testar as versões de desenvolvimento do Xubuntu e de pacotes ajuda a manter a qualidade de cada dia. Se tiver recursos de hardware sobrando ou se for capaz de executar um ambiente de testes virtualizado,você pode ajudar.

source: Check the devel mailing list close to the start of the cycle, where the decision as to which testing week(s) we will participate in will be discussed.
pt_br: Verifique a lista de e-mails quando o início do ciclo estiver perto, onde a decisão de quais semana(s) de testes nós participaremos será discutida.

source: QA Status page
pt_br: página de Status do controle de qualidade

source: During testing weeks the ISO will continue to build, the Xubuntu QA Team will watch the tracker reports and make testers aware of issues noted in previous days, notes will be made as appropriate pn the tracker <_:ulink-1/>.
pt_br: Durante semanas de testes a ISO continuará a ser desenvolvida, a equipe de controle de qualidade do Xubuntu irá observar os relatórios do rastreador e alertar os testadores de problemas observados nos dias anteriores, Observações serão feitas no rastreador apropriado <_:ulink-1/>.

source: Testing Weeks
pt_br: Testes Semanais

source: Fixed ISO testing will only take place for the Final Beta, during this milestone it is useful in the 2 days prior to release for the following to have taken place.
pt_br: Testes fixos da ISO só irão acontecer na Beta final, durante esse marco eles são úteis nos 2 dias anteriores ao lançamento para que o seguinte tenha acontecido.

source: Live Session: Boot with the image and ensure that basic application testing (open, close, saving etc.) passes.
pt_br: Sessão Live: Inicialize com a imagem e garanta que os testes básicos de aplicativos (abrir,fechar,salvar etc.) sejam aprovados.

source: Installation tests required pass. These test only the installation.
pt_br: Testes de instalação exigiram aprovação. Esses testam apenas a instalação.

source: Daily Testing
pt_br: Testes Diários

source: The importance of daily image testing lies mainly in knowing that boot and/or installation regressions haven’t appeared. Where it appears they have, if you are able to boot with a different flavours image, this can help prove a global or local to Xubuntu issue. If unsure contact the Xubuntu team, preferably on IRC.
pt_br: A importância de testes de imagens diárias reside principalmente em saber que regressões na inicialização e/ou instalação não apareceram. Quando aparentam ter aparecido, se você é capaz de inicialize com imagens de flavours diferentes, isso pode ajudar a comprovar um problema global ou local do Xubuntu. Se não tiver certeza contate a equipe Xubuntu, de preferência no IRC.

source: Upgrade Testing
pt_br: Teste de Atualização

source: About half way through any development cycle (around the beta milestones) we need to test upgrades from the previous release to the new development version. When the development version is intended to be the next LTS release, we need to test both upgrade paths: LTS to LTS and regular to LTS.
pt_br: Na metade do caminho de qualquer ciclo de desenvolvimento (em torno dos marcos da beta) precisamos testar atualizações de versões prévias para a nova versão de desenvolvimento. Quando a versão de desenvolvimento é destinada a ser a próxima versão LTS, nós precisaremos testar os dois caminhos de atualização, LTS para LTS e regular para LTS.

source: The ISO tracker has a section for upgrade tests which does not change daily, but runs from Friday to Friday. This enables us to test upgrades for a week rather than a day. During these tests it is preferred that the image used for testing is the one built on the first Friday, except where bugs are reported and fixes landed.
pt_br: O rastreador de ISO possui uma seção para testes de atualização que não muda diariamente, mas é executada de sexta a sexta-feira. Isso nos permite testar atualizações por uma semana, em vez de um dia. Durante esses testes, é preferível que a imagem usada seja uma criada na primeira sexta-feira, exceto quando erros são relatados e as correções são emitidas.

source: Upgrade: tested using the update-manager
pt_br: Atualização: testada usando o gerenciador de atualizações

source: Upgrade (image): tested using the daily image
pt_br: Atualização (imagem): testada usando a imagem diária

source: Package Testing
pt_br: Teste de Pacote

source: For releases where we are making use of the Package Tracker, calls for package testing will be made to the xubuntu-devel mailing list as required. This could be a call from QA or Developers.
pt_br: Para lançamentos onde estamos fazendo uso do Rastreador de Pacote,chamadas para testes de pacotes serão feitas na lista de e-mails xubuntu-devel como requerido. Isso pode ser uma chamada do controle de qualidade ou dos desenvolvedores.

source: Specific developer testing requirement
pt_br: Requerimento para teste específico ao desenvolvedor

source: A schedule of planned tests will be mailed to the Xubuntu Devel mailing list close to the cycle start. Reminders of upcoming package test requirements are mailed to the Xubuntu devel mailing list as required. <_:emphasis-1/> are mailed as they are available, often these packages will be those found on one of our PPAs.
pt_br: Um horário de testes planejados será enviado a lista de e-mails Xubuntu Devel perto do início do ciclo. Lembretes dos próximos requerimentos de testes de pacotes são enviadas a lista de e-mails Xubuntu devel como requerido. <_:emphasis-1/>são enviados assim que disponíveis, muitas vezes esses pacotes serão encontrados em um de nossos PPAs.

source: There are various QA trackers, wiki and Launchpad pages, the links to which can be found on <xref linkend="qa-team-links"/>.
pt_br: Há vários rastreadores de controle de qualidade,páginas de wiki e Launchpad,os links para os quais podem ser encontrados em <xref linkend="qa-team-links"/>.

source: The Xubuntu QA team was formed to ensure that the quality of a released Xubuntu conforms to the parameters laid out in the Xubuntu Processes documents. In order to successfully accomplish this, close team working relationships, especially with the development team and the Xubuntu Council are paramount. Xubuntu's success is based on close working amongst all of its various teams.
pt_br: A equipe de controle de qualidade do Xubuntu foi formada para garantir que a qualidade de um lançamento do Xubuntu esteja em conformidade com os parâmetros estabelecidos nos documentos de processos do Xubuntu. Para conseguir isso, relações de trabalho estreitas da equipe, especialmente com a equipe de desenvolvimento e o Conselho Xubuntu, são fundamentais. O sucesso do Xubuntu é baseado em um trabalho próximo entre todas as suas várias equipes.

source: In addition, the team gives people contributing through testing of Xubuntu the opportunity to become part of the <ulink url="https://launchpad.net/~xubuntu-team">Xubuntu Team</ulink>. For that to be of practical use, the QA team should keep an eye on testing reports on the trackers and propose users they have seen taking a keen interest in the work of the QA team.
pt_br: Além disso,a equipe dá a oportunidade de pessoas colaborando através de testes do Xubuntu se tornarem parte da <ulink url="https://launchpad.net/~xubuntu-team">Equipe Xubuntu</ulink>. Para que isso seja de utilidade prática,a equipe de controle de qualidade deverá manter um olho nos relatos de testes nos rastreadores e propor usuários que aparentam ter um interesse no trabalho da equipe de controle de qualidade.

source: Excluding testing itself, control of the testcases that we use for ISO and Package testing, along with communicating the testing requirements for any particular development cycle (hereafter cycle) to the community, makes up the bulk of the teams work in any given cycle.
pt_br: Excluindo a testagem em si, o controle dos casos de teste que usamos para os testes de ISO e Pacote, além de comunicar os requisitos de teste para qualquer ciclo de desenvolvimento específico (no ciclo seguinte) à comunidade, compõe a maior parte das equipes que trabalham em qualquer ciclo.

source: Members of the QA team should check the current Xubuntu QA blueprint, and assign themselves to tasks they feel able to undertake.
pt_br: Os membros da equipe de controle de qualidade devem observar o modelo atual do controle de qualidade do Xubuntu, e assumir tarefas que se sintam capazes de realizar.

source: At the start of a cycle, the Release Team will discuss which ISO Testing Weeks we will participate in. Then, during a Community Meeting, members of Xubuntu Team will discuss and then ratify Xubuntu's participation during the cycle.
pt_br: No início de um ciclo, a equipe de Lançamento discutirá qual ISO das Semanas de Testagem nós vamos participar. Em seguida, durante uma Reunião da Comunidade, membros da equipe do Xubuntu discutirão e então ratificarão a participação do Xubuntu durante o ciclo.
