Repository: Xubuntu-Team/xubuntu-docs
Catalog: contributor-docs/po/*.po
Languages: pt_br

source: Where possible and appropriate, the Xubuntu team should work together with other communities, including other Ubuntu teams and upstream. If cooperation at a given time is not possible but would be beneficial for both parties, the Xubuntu team should try to allocate some resources to the cooperation at a later time.
pt_br: Assim que possível e apropriado, a equipe do Xubuntu deve trabalhar junta a outras comunidades, incluindo outras equipes do Ubuntu e além. Se a cooperação em um dado momento não for possível, mas for benéfica para ambas as partes, a equipe do Xubuntu deve tentar alocar recursos para cooperação em um outro momento.

source: Community
pt_br: Comunidade

source: Xubuntu Council
pt_br: Conselho do Xubuntu

source: The Xubuntu Council (later: council) is responsible for overseeing the development direction of Xubuntu and enabling the community to work with Xubuntu as smoothly as possible. The council serves a term of four releases/two years at a time, ending with an LTS release to allow long-term planning.
pt_br: O Conselho do Xubuntu (mais tarde: conselho) é responsável por supervisionar a direção de desenvolvimento de Xubuntu e permitir que a comunidade trabalhe com Xubuntu o mais harmoniosamente possível. O conselho serve um termo de quatro liberações/dois anos de cada vez, terminando com uma liberação de LTS para permitir o planejamento a longo prazo.

source: The xubuntu-council Launchpad team consists of the council members. The xubuntu-council team is the administrator for all other Xubuntu Launchpad teams, giving the council full administration access for the Xubuntu teams.
pt_br: A equipe do Launchpad do xubuntu-council é composta pelos membros do conselho. A equipe xubuntu-council é a administradora de todas as outras equipes Xubuntu Launchpad, dando ao conselho acesso total à administração para as equipes do Xubuntu.

source: Membership
pt_br: Membro

source: Xubuntu Team
pt_br: Equipe do Xubuntu

source: The council consists of 3 members, who are chosen by a <_:ulink-1/> vote. All members in the <_:ulink-2/> and/or direct members of any moderated subteams can be nominated, either by themselves or anybody else in the Xubuntu community with the nominees consent. The same group of people is eligible to vote.
pt_br: O conselho é composto por 3 membros, que são escolhidos por um voto <_:ulink-1/>. Todos os membros em <_:ulink-2/> e/ou membros diretos de quaisquer sub-equipes moderadas podem ser nomeadas, por si ou por qualquer outra pessoa na comunidade Xubuntu com o consentimento dos candidatos. O mesmo grupo de pessoas está qualificado para votar.

source: If a council member becomes inactive for 6 months, the member shall be replaced by a new council member for the remainder of their term, elected by a new CIVS vote.
pt_br: Se um membro do conselho ficar inativo por 6 meses, o membro será substituído por um novo membro do conselho pelo período restante, eleito por um novo voto CIVS.

source: The council will decide on a chair for the whole council term. The chair will act as the official point of contact for Xubuntu.
pt_br: O conselho decidirá sobre uma cadeira para todo o mandato do conselho. A cadeira atuará como o ponto de contato oficial para Xubuntu.

source: Council operation
pt_br: Operação do conselho

source: The council is expected to take action or respond to any issue raised within 2 weeks. If appropriate and fair, the first action can be postponement.
pt_br: Espera-se que o conselho tome medidas ou responda a qualquer questão levantada dentro de 2 semanas. Se apropriado e justo, a primeira ação pode ser adiada.

source: If at any time a majority of the Xubuntu team considers the actions of the council harmful for the project, the issue at hand should be raised to the council for reconsideration. If a resolution can't be found, the council should consult the the Ubuntu Community Council and other appropriate Ubuntu community teams. Similarly, if the council can't reach a consensus even after consulting the Xubuntu team, they should consult the Ubuntu Community Council and other appropriate Ubuntu community teams.
pt_br: Se em qualquer momento uma maioria da equipe Xubuntu considerar as ações do conselho prejudiciais para o projeto, o problema em questão deve ser levantada para o conselho para reconsideração. Se uma resolução não puder ser encontrada, o conselho deve consultar o Conselho da Comunidade do Ubuntu e outras equipes apropriadas da comunidade do Ubuntu. Da mesma forma, se o conselho não puder chegar a um consenso, mesmo depois de consultar a equipe Xubuntu, eles devem consultar o Conselho Comunitário do Ubuntu e outras equipes apropriadas da comunidade Ubuntu .

source: The Xubuntu team is a group of individuals who are primarily responsible for the Xubuntu development.
pt_br: A equipe do Xubuntu é um grupo de indivíduos que são os principais responsáveis pelo desenvolvimento do Xubuntu.

source: The Xubuntu team is organized in Launchpad as <_:ulink-1/>. The Launchpad team is moderated.
pt_br: A equipe Xubuntu é organizada no Launchpad como <_:ulink-1/>. A equipe do Launchpad é moderada.

source: The individuals wanting to join the Xubuntu team are required to meet the criteria described below prior to applying or they will be automatically declined. Leaders for subteams can be appointed from this team. The Xubuntu team is moderated by the council.
pt_br: Os indivíduos que desejarem aderir à equipe Xubuntu são obrigados a cumprir os critérios descritos abaixo antes de aplicar ou eles serão automaticamente recusados. Líderes para subequipes podem ser nomeados nesta equipe. A equipe Xubuntu é moderada pelo conselho.

source: In case a team lead is in the minority when voting on an issue that concerns their area of expertise, the team lead should be given another hearing, after which the team should take extra care in deciding about the issue and may want to consider voting on it again after more discussion. If required, the issue can be raised to the council for further consideration.
pt_br: Caso um líder de equipe seja minoritário ao votar em uma questão que diga respeito à sua área de atuação, o líder da equipe deve receber outra audiência, após o que a equipe tiver tomado cuidado extra ao decidir sobre o assunto e pode querer considerar a votação novamente depois de mais discussão. Se necessário, a questão pode ser levantada para o conselho para posterior consideração.

source: Becoming and staying a member
pt_br: Tornando-se um Membro e Permanecendo

source: To be accepted to the Xubuntu team, applicants participants must demonstrate their motivation and ability to contribute to Xubuntu. This is to ensure that any Xubuntu team member has a sufficient understanding of the Xubuntu community and its operation. The different steps one must go through will also indicate that the candidate member is able to work within the guidelines, and more important, with other people and communities. To become a member, one must:
pt_br: Para serem aceitos pela equipe Xubuntu, os participantes devem demonstrar sua motivação e capacidade de contribuir para o Xubuntu. Isso é para garantir que qualquer membro da equipe Xubuntu tenha uma compreensão suficiente da comunidade Xubuntu e sua operação. As diferentes etapas que devem ser seguidas também indicam que o membro candidato é capaz de trabalhar dentro das diretrizes e, mais importante, com outras pessoas e comunidades. Para se tornar um membro, deve-se:

source: Commit meaningful contributions to one of the subteams, after which one can be approved to the subteam for "probation" by a subteam administrator
pt_br: Comprometer contribuições significativas para uma das subequipes, após o que se pode ser aprovado para a subequipe para "provação" por um administrador de subequipe.

source: Demonstrate motivation to contribute perpetually, after which one can be approved to the Xubuntu team
pt_br: Demonstrar motivação para contribuir perpetuamente, após o qual pode ser aprovado para a equipe Xubuntu

source: To stay a member of the Xubuntu team, the member will have to have desire to continue contributing in the future. Anyone with no contributions for more than a complete cycle (6 months) should deactivate themself from the team as well as all subteams and reapply if/when they are willing to rejoin. The team administrators should purge people with no contributions in more than 6 months from the teams occasionally.
pt_br: Para continuar sendo um membro da equipe Xubuntu, o membro terá que ter o desejo de continuar a contribuir no futuro. Qualquer pessoa que não tenha contribuído mais do que um ciclo completo (6 meses) deve desativar-se da equipe, bem como todas as sub-equipes e reaplicar se/quando eles estiverem dispostos a voltar. Os administradores da equipe devem limpar as pessoas sem contribuições em mais de 6 meses das equipes ocasionalmente.

source: Xubuntu Users
pt_br: Usuários Xubuntu

source: The Launchpad team <_:ulink-1/> is the formal top-level group of people who are interested in Xubuntu. The team is open for anybody to join.
pt_br: A equipe do Launchpad <_:ulink-1/> é o grupo formal de alto nível de pessoas que estão interessadas no Xubuntu. A equipe está aberta para qualquer pessoa se juntar.

source: The members of the official Launchpad group are encouraged to give user support on IRC and on the Xubuntu users mailing list as well as spread the word about Xubuntu anywhere they see fit, including but not limited to blogs, social media and conferences.
pt_br: Os membros do grupo oficial do Launchpad são encorajados a dar suporte ao usuário no IRC e na lista de discussão dos usuários do Xubuntu, bem como a espalhar a palavra sobre o Xubuntu em qualquer lugar que acharem conveniente, incluindo mas não limitado a blogs, mídias sociais e conferências.

source: Website Administrators
pt_br: Administradores do site

source: In addition to user support and advocacy, the members are free to organize as they like on social media platforms and more. If the group is considered substantial and useful enough, the Xubuntu team can name it official and help with maintaining it. All currently official teams and their administrators are listed on the Xubuntu wiki under the <_:ulink-1/> page.
pt_br: Além de suporte ao usuário e advocacia, os membros são livres para organizar como eles gostam em plataformas de mídia social e muito mais. Se o grupo é considerado substancial e útil o suficiente, a equipe Xubuntu pode nomeá-lo oficial e ajudar com a manutenção. Todas as equipes oficiais e seus administradores estão listadas no wiki do Xubuntu na página <_:ulink-1/>.

source: Coordination
pt_br: Coordenação

source: The direction of the development of the project is coordinated by:
pt_br: A direção do desenvolvimento do projeto é coordenada por:

source: The Strategy Document
pt_br: O documento estratégico

source: Release-specific blueprints and specifications
pt_br: Modelos e especificações específicos da versão

source: The community meetings
pt_br: As reuniões da comunidade

source: The developer communication tools listed below
pt_br: As ferramentas de comunicação do desenvolvedor listadas abaixo

source: Communication
pt_br: Comunicação

source: For Xubuntu to be successful, its members and community must have the right tools to enable useful and helpful communication and ultimately, to help the community grow. These communication tools include the following "core" tools:
pt_br: Para que o Xubuntu seja bem sucedido, seus membros e comunidade devem ter as ferramentas certas para permitir uma comunicação útil e, em última análise, ajudar a comunidade a crescer. Essas ferramentas de comunicação incluem as seguintes ferramentas "básicas":

source: Mailing lists
pt_br: Lista de discussão

source: <_:emphasis-1/>; Xubuntu-users for community support and user discussions and the Xubuntu-devel list for development discussion and coordination
pt_br: <_:emphasis-1/>; Xubuntu-users para suporte comunitário e discussões de usuários e a lista Xubuntu-devel para discussão e coordenação de desenvolvimento

source: IRC channels
pt_br: Canais de IRC

source: <_:emphasis-1/>; #xubuntu for community support, #xubuntu-devel for development discussion and coordination and #xubuntu-offtopic for general discussion with a more relaxed mood
pt_br: <_:emphasis-1/>; #xubuntu para suporte comunitário, #xubuntu-devel para discussão e coordenação de desenvolvimento e #xubuntu-offtopic para discussão geral com um humor mais descontraído

source: <_:emphasis-1/> for team organization and granting permissions and access rights via team memberships
pt_br: <_:emphasis-1/>para organização da equipe e concessão de permissões e direitos de acesso através de membros da equipe

source: The Xubuntu website
pt_br: O site do Xubuntu

source: <_:emphasis-1/> for news, development articles and general information about Xubuntu
pt_br: <_:emphasis-1/>para notícias,artigos de desenvolvimento e informações gerais sobre o Xubuntu

source: The Xubuntu developer area
pt_br: A área de desenvolvedor do Xubuntu

source: <_:emphasis-1/> for tracking development progress and collaborating on development issues and sharing development related information on the wiki
pt_br: <_:emphasis-1/> para acompanhar o progresso do desenvolvimento e colaborar em questões de desenvolvimento e compartilhar informações relacionadas ao desenvolvimento na wiki

source: In addition to communicating with each other and the Xubuntu community, the Xubuntu team should communicate continuosly with other Ubuntu contributors, upstream and other projects related to Xubuntu. The team members should take part in the development discussion outside Xubuntu as well to create and maintain healthy relationships with other projects and their developers.
pt_br: Além de se comunicarem uns com os outros e com a comunidade Xubuntu, a equipe Xubuntu deve se comunicar continuamente com outros colaboradores do Ubuntu, upstream e outros projetos relacionados ao Xubuntu. Os membros da equipe devem tomar parte na discussão de desenvolvimento fora do Xubuntu, bem como para criar e manter relacionamentos saudáveis com outros projetos e seus desenvolvedores.

source: Dispute Resolution
pt_br: Resolução de disputas

source: The Code Of Conduct (CoC) is one of the most fundamental documents in the Ubuntu community, including Xubuntu, and it functions as the base for a working community. Everybody and every communicating medium in the Xubuntu community is CoC-compliant at all times.
pt_br: O Código de Conduta (CoC) é um dos documentos mais fundamentais na comunidade Ubuntu, incluindo Xubuntu, e funciona como a base para um trabalho comunitário. Todo mundo e todos os meios de comunicação na comunidade Xubuntu são compatíveis com CoC em todos os momentos.

source: Ubuntu Code of Conduct
pt_br: Código de conduta do Ubuntu

source: To read the most recent revision of the Ubuntu Code of Conduct, refer to the <_:ulink-1/> page on the Ubuntu website.
pt_br: Para ler a revisão mais recente do código de conduta Ubuntu,refira-se a página <_:ulink-1/> no website do Ubuntu

source: The Ubuntu Community Council can be asked to act as mediators/advisors where their expertise would be useful when the Xubuntu Council requires assistance. The Xubuntu Council and the Xubuntu team are encouraged to talk to other teams in the Ubuntu community if it helps resolving the issue.
pt_br: O conselho da comunidade Ubuntu pode ser solicitado a atuar como mediadores/assessores onde seus conhecimentos seriam úteis quando o conselho Xubuntu requer assistência. O conselho Xubuntu e a equipe Xubuntu são encorajados a conversar com outras equipes da comunidade Ubuntu se isso ajudar a resolver o problema.

source: When disputes occur, contributors are strongly encouraged to refrain from taking the disputed actions to avoid sabotaging the dispute resolution process.
pt_br: Quando as disputas ocorrem, os contribuintes são fortemente encorajados a abster-se de tomar as ações contestadas para evitar sabotar o processo de resolução de disputas.

source: Release and Support Cycles
pt_br: Ciclos de liberação e suporte

source: The Xubuntu release cycle consists of 6 months from start to release, then an additional 9 month of maintenance for standard releases and 3 years of support for LTS releases. Although the Xubuntu project itself can not provide commercial support or commercial guarantees, the Xubuntu team will make every effort to conform with the acknowledged support period and provide security updates for Xubuntu packages.
pt_br: O ciclo de lançamento do Xubuntu consiste em 6 meses do início ao lançamento, em seguida, um mês adicional de 9 meses de manutenção para versões padrão e 3 anos de suporte para lançamentos LTS. Embora o próprio projeto Xubuntu não possa oferecer suporte comercial ou garantias comerciais, a equipe Xubuntu fará todos os esforços para estar em conformidade com o período de suporte reconhecido e fornecer atualizações de segurança para pacotes Xubuntu.

source: For more information about the specifics of the processes related to developing a release, see <_:xref-1/>.
pt_br: Para obter mais informações sobre os detalhes dos processos relacionados ao desenvolvimento de uma versão, consulte <_:xref-1/>.

source: Seeds and Composition
pt_br: Sementes e composição

source: Core Components
pt_br: Componentes do núcleo

source: The following packages and their technical dependencies are considered essential in composing an operating system that represents the goals set previously in this document:
pt_br: Os pacotes a seguir e suas dependências técnicas são considerados essenciais na composição de um sistema operacional que representa os objetivos definidos anteriormente neste documento:

source: xfwm4 (Xfce4 window manager)
pt_br: xfwm4 (gerenciador de janelas do Xfce4)

source: xfdesktop4 (Xfce4 desktop)
pt_br: xfdesktop4 (área de trabalho do Xfce4)

source: xfce4-panel (Xfce4 panel)
pt_br: xfce4-panel (painel do Xfce4)

source: xfce4-session (Xfce4 session manager)
pt_br: xfce4-session (gerenciador de sessão do Xfce4)

source: xfconf (Xfce4 configuration storage system)
pt_br: xfconf (sistema de armazenamento de configuração do Xfce4)

source: xfce4-settings (Xfce4 settings manager)
pt_br: xfce4-settings (gerenciador de configurações do Xfce4)

source: thunar (file manager)
pt_br: thunar (gerenciador de arquivos)

source: Unless the components mentioned above are deprecated and no longer work as they are intended, they should not be substituted or removed from the seed.
pt_br: A menos que os componentes mencionados acima estejam depreciados e deixem de funcionar como pretendem, não devem ser substituídos ou removidos da semente.

source: The <_:literal-1/> metapackage consists of the core packages as well as other important packages which contribute to the Xubuntu experience. The <_:literal-2/> metapackage depends on the core metapackage and includes additional packages to provide the full, ready to use, Xubuntu experience.
pt_br: O meta-pacote <_:literal-1/> consiste nos pacotes principais, bem como em outros pacotes importantes que contribuem para a experiência do Xubuntu. O meta-pacote <_:literal-2/>depende do meta-pacote principal e inclui pacotes adicionais para fornecer a experiência completa, pronta a usar,do Xubuntu.

source: Package Selection
pt_br: Seleção de pacotes

source: When considering the package selection for Xubuntu, there are two main guidelines:
pt_br: Ao considerar a seleção de pacotes para Xubuntu, existem duas diretrizes principais:

source: The package must be in line with the mission statement
pt_br: O pacote deve estar em linha com a declaração de missão

source: The package selection process must be conducted as objectively as possible
pt_br: O processo de seleção de pacotes deve ser conduzido o mais objetivamente possível

source: While the Xubuntu Technical Lead has the last word on package selection with the approval of the Xubuntu Council, it's recommended that the whole team is involved in the discussion, bringing up well thought out arguments both for and against. When appropriate, tests should be conducted to gather meaningful measurements.
pt_br: Enquanto a linha técnica Xubuntu tem a última palavra sobre a seleção de pacotes com a aprovação do conselho Xubuntu, recomenda-se que toda a equipe esteja envolvida na discussão, trazendo argumentos bem pensados tanto para e contra. Quando apropriado, os testes devem ser conduzidos para coletar medições significativas.

source: Before seeding an application in Xubuntu, the following aspects should be considered:
pt_br: Antes de semear uma aplicação em Xubuntu, os seguintes aspectos devem ser considerados:

source: Usability and integration
pt_br: Usabilidade e integração

source: Usefulness
pt_br: Utilidade

source: Resource consumption and size
pt_br: Consumo e tamanho dos recursos

source: Reliability
pt_br: Confiança

source: Localization
pt_br: Localização

source: When measuring if a package is right for Xubuntu, the decision should not be based on an analysis of the package alone, but the target package along with its dependencies. Any package that is considered for seeding should fulfill the following requirements:
pt_br: Ao medir se um pacote é certo para Xubuntu, a decisão não deve ser baseada em uma análise do pacote sozinho, mas o pacote de destino, juntamente com suas dependências. Qualquer embalagem que seja considerada para semeadura deve satisfazer os seguintes requisitos:

source: The package should use the GTK toolkit
pt_br: O pacote deve usar o kit de ferramentas GTK

source: The package should not pull in heavy libraries, especially if they will run and/or start frequently
pt_br: O pacote não deve puxar em bibliotecas pesadas, especialmente se eles vão executar e/ou iniciar frequentemente

source: The package should be well maintained upstream
pt_br: O pacote deve ser mantido pelo upstream

source: The above guidelines can be omitted with the approval of the council when there are extensive benefits to seeding the package.
pt_br: As diretrizes acima podem ser omitidas com a aprovação do conselho quando há amplos benefícios para semear o pacote.

source: Website
pt_br: Site

source: Introduction to the Xubuntu web presence
pt_br: Introdução à apresentação do Xubuntu na web

source: <emphasis>The website is the main output for end-users.</emphasis> The content on the website should be easily understandable and approachable.
pt_br: <emphasis>O site é a principal fonte de informação para usuários finais.</emphasis> O conteúdo do site deve ser facilmente compreensível e acessível.

source: The website is a WordPress instance on a server maintained by the Canonical IS. The website content is overseen and administrated by the Xubuntu website team. The website team can submit tickets to the Canonical IS for any problems. Bugs that are related to the website can be submitted on Launchpad, under the <ulink url="https://bugs.launchpad.net/xubuntu-website/+bugs">bugs for xubuntu-website</ulink>.
pt_br: Este site é uma instância do WordPress em um servidor mantido pela Canonical IS. O conteúdo é supervisionado e administrado pelo time do website do Xubuntu. Este time pode abrir tickets para a Canonical IS, em caso de problemas. Bugs que são relatados no site podem ser reportados ao Launchpad, no endereço <ulink url="https://bugs.launchpad.net/xubuntu-website/+bugs">bugs for xubuntu-website</ulink>.
