Repository: Xubuntu-Team/xubuntu-docs
Catalog: contributor-docs/po/*.po
Languages: pt_br

source: Along with general testing of our OS, dealt with further in <xref linkend="qa-testing-exploratory"/> and <xref linkend="qa-testing-ppa"/>, further responsibilities lie with ensuring that:
pt_br: Juntamente com os testes gerais de nosso SO,tratados mais adiante em <xref linkend="qa-testing-exploratory"/> e<xref linkend="qa-testing-ppa"/>, responsabilidades adicionais cabem a garantir que:

source: Sufficient testing takes place during ISO Testing Weeks
pt_br: Testes suficientes aconteçam durante as semanas de testes de ISO

source: Sufficient package testing takes place following calls to testers
pt_br: Testes suficientes de pacotes ocorrem após chamadas para testadores.

source: Sufficient testing has taken place by Final Release
pt_br: Testes suficientes foram realizados na Versão Final

source: Bugs reported to our trackers are confirmed, or where unable to confirm, further information is requested from the reporter
pt_br: Os erros relatados aos nossos rastreadores são confirmados ou, quando não é possível confirmar, mais informações são solicitadas ao relator

source: Where appropriate, confirmation of bugs can be asked of members of Xubuntu Team in the team devel IRC channel
pt_br: Onde apropriado, a confirmação de erros pode ser solicitada aos membros da equipe do Xubuntu no canal da equipe de desenvolvimento no IRC

source: Members of the QA team might find it useful subscribing to the <ulink url="https://launchpad.net/~xubuntu-bugs">Xubuntu Bugs</ulink> team in order to be aware of bugs being reported by users.
pt_br: Membros da equipe de Controle de Qualidade podem achar útil inscrever-se na equipe de <ulink url="https://launchpad.net/~xubuntu-bugs"> Erros do Xubuntu </ulink> para acompanhar os erros relatados pelos usuários.

source: Working with trackers
pt_br: Trabalhando com rastreadores

source: The initial decisions on what and when to test, will be taken following discussion with the members of the <ulink url="https://launchpad.net/~xubuntu-release">Xubuntu Release</ulink> team.
pt_br: As decisões iniciais sobre o que e quando testar,serão tomadas após discussão com os membros da equipe<ulink url="https://launchpad.net/~xubuntu-release"> de lançamento do Xubuntu</ulink>.

source: At the start of a cycle, the QA team needs to ensure that:
pt_br: No início de um ciclo, a equipe de controle de qualidade deve assegurar que:

source: Image testcases we use are still correct.
pt_br: casos de testes das imagens que usamos ainda estão corretos.

source: When the intention is that package testing will take place during the cycle, package testcases required during the cycle are still correct.
pt_br: Quando a intenção é o teste de pacotes ocorrer durante o ciclo, casos de testes de pacotes requeridos durante o ciclo ainda estão corretos.

source: The testsuites on the Package Tracker make sense for what we intend to test during the cycle. Differences between regular and LTS releases are often, but not always, needed.
pt_br: O pacote de testes no Rastreador de Pacotes faz sentido para o que pretendemos testar durante o ciclo. Diferenças entre as versões regulares e LTS são muitas vezes,mas nem sempre,necessárias.

source: Scheduling of ISO, and when appropriate Package, testing should take place amongst the QA team.
pt_br: Horário de testes da ISO,e de pacotes quando apropriado, deverá ocorrer entre a equipe do controle de qualidade.

source: When there are changes to a package we test, following for example a bug fix, a further check of the testcase involved should take place. Further testing calls for that package should be made to check for regression during the cycle.
pt_br: Quando houver alterações em um pacote que testamos, seguindo, por exemplo, uma correção de erro, uma verificação adicional do teste de caso envolvido deve ser realizada. Solicitações de teste adicionais para esse pacote devem ser feitas para verificar a regressão durante o ciclo.

source: When a package during test constantly fails, or bug reports indicate a failure in a package for something not tested, the testcase for that package can be disabled temporarily. The QA Lead is responsible for ensuring tests are both disabled and re-enabled when appropriate.
pt_br: Quando um pacote falha constantemente durante os testes, ou relatos de erros indicam uma falha em um pacote por algo não testado, o caso de teste para esse pacote pode ser desativado temporariamente. O líder de controle de qualidade é responsável por garantir que os testes sejam desativados e reativados quando apropriado.

source: Xubuntu ISOs are built and added to the tracker at approximately 02:00 UTC. This time can be changed by amending our build times on the <ulink url="http://bazaar.launchpad.net/~ubuntu-cdimage/ubuntu-cdimage/mainline/files/head:/etc/">ubuntu-cdimage crontab</ulink> and proposing the change.
pt_br: ISOs Xubuntu são desenvolvidas e adicionadas ao rastreador á aproximadamente 02:00 UTC. Essa hora pode ser mudada ao alterar nossos horários de desenvolvimento na <ulink url="http://bazaar.launchpad.net/~ubuntu-cdimage/ubuntu-cdimage/mainline/files/head:/etc/">ubuntu-cdimage crontab</ulink> e propondo a alteração.

source: Working with testcases
pt_br: Trabalhando com casos de teste

source: Information on the basic method of working with testcases can be found at the Ubuntu QA Team <ulink url="https://wiki.ubuntu.com/QATeam/ContributingTestcases/Manual">Manual Testcases</ulink> page.
pt_br: Informação sobre o método básico de trabalhar com casos de testes pode ser encontrada no manual de casos de testes <ulink url="https://wiki.ubuntu.com/QATeam/ContributingTestcases/Manual">na página da Equipe de controle de qualidade do Ubuntu</ulink>.

source: <emphasis>We</emphasis> are only concerned with a specific set of tasks: grabbing the branch, making edits and then pushing the changes we need to the main branch. We have people in the Testcase Admin team for the LP Testcases, in addition any member of our Release Team can edit the tracker, this helps ensure that changes are moved through to the trackers quickly.
pt_br: <emphasis>Nós</emphasis>estamos apenas preocupados com um conjunto específico de tarefas: puxando a branch,fazendo edições e então enviando as mudanças que precisamos para a branch principal. Nós temos pessoas na equipe de Administradores de Casos de Teste para os casos de testes LP, além disso qualquer membro da nossa equipe de lançamento pode editar o rastreador, isso ajuda a garantir que alterações sejam movidas aos rastreadores rapidamente.

source: To edit a testcase:
pt_br: Para editar um caso de teste:

source: <ulink url="https://bugs.launchpad.net/ubuntu-manual-tests/+filebug">Report</ulink> the required change as a bug against the testcase project
pt_br: <ulink url="https://bugs.launchpad.net/ubuntu-manual-tests/+filebug">Relatar</ulink>a alteração requerida como um bug contra o projeto de caso de teste

source: Assign yourself to the bug
pt_br: Atribua-se ao bug

source: Create a local branch: <userinput>bzr branch lp:ubuntu-manual-tests</userinput>
pt_br: Criar uma branch local: <userinput>bzr branch lp:ubuntu-manual-tests</userinput>

source: Make changes to the testcase in your local branch
pt_br: Faça alterações no caso de teste em sua branch local

source: Commit the changes: <userinput>bzr commit -m "Fix LP bug #BUGNO."</userinput>
pt_br: Enviar as alterações: <userinput>bzr commit -m "Fix LP bug #BUGNO."</userinput>

source: Push to a personal remote branch: <userinput>bzr push lp:~username/ubuntu-manual-tests/bug-BUGNO</userinput>
pt_br: Enviar a uma branch remota pessoal: <userinput>bzr push lp:~username/ubuntu-manual-tests/bug-BUGNO</userinput>

source: Once pushed to a personal remote branch, propose the change for merging - <xref linkend="bzr-merge-proposal"/>.
pt_br: Uma vez enviada a uma branch remota pessoal, propor uma alteração para mesclagem - <xref linkend="bzr-merge-proposal"/>.

source: Respond to any requests for changes when asked by the Testcase Admins in order to get the required change through in a timely manner.
pt_br: Responda á quaisquer solicitações para alterações quando pedidas pelos administradores de casos de testes para conseguir a alteração requerida em tempo hábil.

source: Communicating with Testers and Users
pt_br: Comunicação com Testadores e Usuários

source: While we have two sets of people in the community that we contact about required testing, Testers will get regular contact from us, but we should only, in general, call on Users at later stages.
pt_br: Embora tenhamos dois grupos de pessoas na comunidade que nós contatamos sobre testes requeridos. Testadores serão contatados regularmente por nós,mas nós devemos apenas,em geral,chamar usuários em fases posteriores.

source: The QA Lead will be an administrator on the Testers Launchpad page and can contact those users via LP. Copies of testing calls sent to the devel mailing list should go to this group each time.
pt_br: A liderança do controle de qualidade será um administrador na página Launchpad de testadores e poderá contatar esses usuários através do LP. cópias de chamadas para testes enviadas a lista de e-mails devel devem ser dirigidas a esse grupo a cada vez.

source: Any member of the QA team can:
pt_br: Qualquer membro da equipe de QA pode:

source: Mail the devel list with a testing call
pt_br: Poste a lista devel com uma chamada para testes

source: Just prior to an upcoming ISO testing week call, warn on the devel list
pt_br: Pouco antes de uma chamada para uma semana de testes da ISO,avise na lista devel

source: Make an ISO testing week call
pt_br: Faça uma chamada para uma semana de testes de ISO

source: Xubuntu Users will be contacted for ISO testing at the Final Beta ISO Milestone.
pt_br: Usuários do Xubuntu serão contatados para testes de ISO no Marco da Beta Final.

source: Release Responsibilities
pt_br: Responsabilidades de Lançamento

source: Much of the responsibility for the QA team at any release lies with the QA Lead.
pt_br: Grande parte da responsabilidade com a equipe de controle de qualidade, em qualquer lançamento, está com a liderança da equipe.

source: However, <emphasis>any</emphasis> member of the QA team can:
pt_br: Contudo, <emphasis>qualquer</emphasis> membro da equipe de controle de qualidade pode:

source: Work with the testing wiki <ulink url="https://wiki.xubuntu.org/releases/18.10/release-notes">Release Note</ulink>
pt_br: Trabalhe com a wiki de testes <ulink url="https://wiki.xubuntu.org/releases/18.10/release-notes">Nota de lançamento</ulink>

source: Check status of bugs listed on the above draft
pt_br: Verifique o status de bugs listados no rascunho acima

source: Check status of work items on the QA blueprint, marking as appropriate
pt_br: Verifique os status de itens de trabalho no diagrama do controle de qualidade, marcando conforme apropriado

source: Post Release Tasks
pt_br: Tarefas de Pós-Lançamento

source: Following release, there are a few tasks that need to be done before the next release cycle begins.
pt_br: Após o lançamento, há algumas tarefas que precisam ser realizadas antes do início do próximo ciclo de lançamento.

source: QA Lead should set up the blueprints for both the QA team and the Bugs that the whole team uses
pt_br: A liderança do controle de qualidade deverá configurar os diagramas para o uso das equipes de Controle de Qualidade e de Bugs que é usado por toda a equipe

source: Check that the draft Release Note is up to date
pt_br: Verifique se o rascunho da nota de lançamento está atualizado

source: Strategy Document
pt_br: Documento Estratégico

source: Introduction
pt_br: Introdução

source: About this Document
pt_br: Sobre este Documento

source: This document will describe the strategy, vision and direction of the Xubuntu project as well as act as a guide and a reference for the Xubuntu Team.
pt_br: Este documento irá descrever a estratégia, visão e direção do projeto Xubuntu, assim como servirá como guia e uma referência para o time do Xubuntu.

source: This revised version has been written by Pasi Lallinaho with the help of Elizabeth Krumbach and Simon Steinbeiß along with numerous people in the community. This version is based on the former Xubuntu Strategy Document by Cody Somerville et al.
pt_br: Esta versão revisada tem sido escrita por Pasi Lallinaho,com a ajuda de Elizabeth Krumbach e Simon Steinbeiß, junto com várias pessoas da comunidade. Esta versão é baseada no antigo Xubuntu Strategy Document, escrito por Cody Somerville et al.

source: We wish thank to Cody Somerville, Jono Bacon, Eero Tamminen, Nico Veenkamp and Lionel Le Folgoc for their contributions to this document. Some content, ideas, and inspiration were derived from existing Ubuntu documentation.
pt_br: Nós gostariamos de agradecer a Cody Somerville, Jono Bacon, Eero Tamminen, Nico Veenkamp e Lionel Le Folgoc, pelas suas contribuições a este documento. Alguns conteúdos, ideias e inspiração foram derivados da documentação existente do Ubuntu.

source: Mission Statement
pt_br: Declaração de Missão

source: Xubuntu is a community-developed, Ubuntu-based operating system that combines elegance and ease of use. Xubuntu provides a light, stable and configurable desktop environment with conservative workflows. Xubuntu delivers a polished and unified product ready for end-users.
pt_br: O Xubuntu é um sistema operacional baseado no Ubuntu, desenvolvido pela comunidade, que combina elegância e facilidade de uso. Ele oferece um desktop leve, estável e personalizável com fluxos de trabalho conservadores. O Xubuntu oferece um produto polido e unificado, pronto para usuários finais.

source: In addition to the technical aspects, the Xubuntu team focuses on contributor and user communities.
pt_br: Para além dos aspectos técnicos, o time do Xubuntu se concentra nas comunidades de contribuintes e usuários.

source: Target
pt_br: Objetivo

source: The target audience for Xubuntu consists of users who are interested in having an elegant, easy to use, polished and unified operating system. Xubuntu is a good option for those who want a stable, configurable and/or relatively light desktop environment too. Finally, Xubuntu is an appealing choice for users who prefer conservative workflows over the newest innovations.
pt_br: O público-alvo do Xubuntu são usuários que estão interessados em ter um sistema operacional elegante, fácil de usar, polido e unificado. O Xubuntu é uma boa opção para aqueles que querem um desktop estável, personalizável e/ou relativamente leve. Finalmente, o Xubuntu é uma escolha atraente para usuários que preferem fluxos de trabalho conservadores em detrimento das inovações recentes.

source: Xubuntu does not target users with specific skill sets or aptitudes. We want Xubuntu to be a viable option for users who are new to Linux or the Ubuntu platform, but also be appealing to more experienced users. Xubuntu does not specifically focus on new users or users migrating from Windows, but according to this ease of use, it is a good alternative for those users as well.
pt_br: O Xubuntu não objetiva atender usuários com conhecimentos ou habilidades específicas. Nós queremos que o Xubuntu seja uma opção viável para usuários que são novos no Linux ou na plataforma Ubuntu, mas que também seja atraente para usuários experientes. O Xubuntu não foca especificamente em novos usuários ou usuários migrando do Windows, mas por ser um sistema de fácil utilização, ele acaba se tornando uma boa alternativa para estes usuários também.

source: Xubuntu does not explicitly target users with low, modest, or high powered machines but instead targets the entire spectrum. Xubuntu's extra responsiveness and speed, among other positive traits, can be appreciated by all users, regardless of their hardware.
pt_br: O Xubuntu não objetiva explicitamente atender usuários com máquinas baixo, modesto ou alto processamento mas, ao invés disso, ele tem como alvo todo o espectro. A capacidade de resposta e a rapidez do Xubuntu, dentre outras características positivas, podem ser apreciadas por todos os usuários, independente do hardware de suas máquinas.

source: While Xubuntu uses Xfce, it is not specifically targeted to Xfce enthusiasts or projects and software being hosted by the Xfce project or associating (officially or unofficially) with Xfce are not guaranteed for inclusion in Xubuntu.
pt_br: Apesar do Xubuntu utilizar o Xfce, ele não é especificamente direcionado a entusiastas do Xfce ou projetos e softwares hospedados pelo projeto Xfce ou associados com o Xfce (oficialmente ou não), uma vez que não há garantias de inclusão destes softwares no Xubuntu.

source: Areas of Focus
pt_br: Áreas de Foco

source: This part of the strategy document provides a transparent framework and a set of priorities for the whole Xubuntu development and its tasks, including but not limited to decision making processes, package selection and technical dispute resolution.
pt_br: Esta parte do documento estratégico oferece uma estrutura transparente e um conjunto de prioridades para todo o desenvovimento do Xubuntu e suas tarefas, incluindo (mas não limitado a) processos de tomada de decisão, seleção de pacotes e resolução de conflitos técnicos.

source: The areas of focus are presented in an abstract and simple form but are also concrete enough to be actionable. As the foundation of the Xubuntu vision, the specifications in the strategy document should not be confused with release-specific goals and priorities, but instead recognized as the principles which the release-specific goals are based on.
pt_br: As áreas de foco são apresentadas de forma abstrata e simples, mas também são concretas o suficiente para serem acionáveis. Como fundamento da visão do Xubuntu, as especificações no documento estratégico não devem ser confundidas com os objetivos e prioridades específicos de cada versão lançada, mas sim reconhecidos como os princípios que baseiam os objetivos específicos de cada versão do Xubuntu.

source: Focus 1: Usability
pt_br: Foco 1: Usabilidade

source: Usability is one of the most important parts of an operating system which is used on a daily basis. This is why Xubuntu should be easy to use and have an appearance that doesn't get in the way. The appearance should be an all-round experience, covering all user interfaces from booting to shutting down.
pt_br: Usabilidade é um dos objetivos mais importantes de um sistema operacional que é utilizado diariamente. Por isso, o Xubuntu deve ser fácil de usar e ter uma aparência que não atrapalhe a usabilidade. Este nível de aparência deverá ser observado em todas as interfaces de usuário, desde o boot até o desligamento.

source: Xubuntu should be localized to allow users to work in their preferred language. Another important aspect of usability is configurability. We believe Xfce gives users the possibility to configure their system in a meaningful way; other applications should live up to this expectation at least moderately well.
pt_br: O Xubuntu deve ser traduzido, para permitir que os usuários o utilizem em seus idiomas preferidos. Outro aspecto importante da usabilidade é a customização. Nós acreditamos que o Xfce oferece aos usuários a possibilidade de configurar seu sistema de maneira significativa; outros aplicativos devem conviver com este aspecto do Xfce de forma moderada.

source: While accessibility is not one of the main priorities of Xubuntu, it should be taken into serious consideration as long as it doesn't require unreasonable efforts to integrate, implement or maintain. At least common accessibility tools should be installed in the default Xubuntu installation.
pt_br: Apesar da acessibilidade não estar entre as prioridades do Xubuntu, ela deve ser levada seriamente em consideração, desde que não exija esforços inviáveis para integrá-la, implementá-la ou mantê-la. Pelo menos as ferramentas de acessibilidade mais comuns devem vir na instalação padrão do Xubuntu.

source: Focus 2: Performance
pt_br: Foco 2: Desempenho

source: The Xubuntu team should strive to make Xubuntu lightweight. This means every Xubuntu release should work moderately well on machines that date to a few years before the release date. This ultimately means that newer Xubuntu releases may not able to support older computers. However, it assures that the Xubuntu team is able to work on other improvements and provide a release that is able to fulfill the expectations for a modern operating system.
pt_br: A equipe do Xubuntu deve se esforçar para fazê-lo ser leve. Isto significa que cada lançamento do Xubuntu deve funcionar moderadamente bem em máquinas antigas, cuja fabricação foi poucos anos antes da data de lançamento da versão. Consequentemente, os lançamentos recentes do Xubuntu podem não suportar computadores muito antigos. Porém, estes lançamentos asseguram que a equipe do Xubuntu é capaz de trabalhar em outras melhorias e oferecer um sistema que é capaz de corresponder às expectativas de um sistema operacional moderno.

source: Users wanting the most lightweight system possible should be pointed at the minimal CD, more lightweight derivatives (such as Lubuntu) or other options.
pt_br: Os usuários que desejam o sistema mais leve possível devem ser direcionados para o CD "minimal", distribuições mais leves (tais como o Lubuntu) ou outras opções.

source: At the start of the release cycle, the minimum system requirements should be re-evaluated to determine if they continue to be realistic.
pt_br: No início do ciclo de cada lançamento, os requisitos mínimos do sistema devem ser reavaliados para determinar se eles continuam sendo realistas.

source: Focus 3: Ready to Use
pt_br: Foco 3: Pronto para Uso

source: It is important for us to provide a polished and unified product that is ready for end-users. It is also a prerequisite to enabling Xubuntu as a useful, usable and effective desktop. Without the mentioned integration, the Xubuntu desktop will appear rough and unpolished which is unappealing to end-users.
pt_br: É muito importante, para nós, oferecer um produto polido e unificado que esteja pronto para usuários finais. Isso também é um prerrequisito para permitir que o Xubuntu seja um desktop útil, prático e eficaz. Sem a integração mencionada, o Xubuntu parecerá áspero e não polido, o que não o tornaria atraente para usuários finais.

source: The integration is accomplished also by selecting applications and libraries that work well with each other as well as by applying patches to assure a more bug-free system.
pt_br: A integração é acompanhada, também, por uma seleção de aplicativos e bibliotecas que trabalham bem entre eles, bem como pela aplicação de patches que asseguram um sistema livre de bugs.

source: See <_:xref-1/> for guidelines on how to determine if an application fits in the Xubuntu stack.
pt_br: Veja <_:xref-1/>para diretrizes sobre como determinar se um aplicativo se encaixa na pilha do Xubuntu.

source: Focus 4: Community
pt_br: Foco 4: Comunidade

source: The Xubuntu community is an important force in creating Xubuntu and making it as perfect as it can be. It's essential that regular coordination between contributors work well. The infrastructure to allow good communication between the contributors as well as users is described more closely in <_:xref-1/> and <_:xref-2/>.
pt_br: A comunidade do Xubuntu é uma força importante na criação dele, que faz ele ser o mais perfeito possível. Para isto, é essencial que a coordenação entre os colaboradores funcione bem. A infraestrutura para permitir esta boa comunicação entre os colaboradores e usuários está descrita mais precisamente em <_:xref-1/> e <_:xref-2/>.
