Repository: Xubuntu-Team/xubuntu-docs
Catalog: contributor-docs/po/*.po
Languages: pt_br

source: Work with the Quality Assurance team to write and maintain testcases
pt_br: Trabalhe com a equipe de controle de qualidade para compor e manter casos de testes

source: Work with the website team to improve the website content and write FAQ or other documentation related articles
pt_br: Trabalhe com a equipe do website para melhorar o conteúdo do website e compor um Perguntas Frequentes ou outros artigos relacionados a documentação

source: Work with the marketing team on various projects, like flyers
pt_br: Trabalhe com a equipe de marketing em vários projetos, como folhetos

source: Translations
pt_br: Traduções

source: Packages to be translated
pt_br: Pacotes a serem traduzidos

source: These are packages that the Xubuntu team considers important, and should take precedence when translating.
pt_br: Estes são pacotes que a equipe do Xubuntu considera importante, e deverá ter precedência durante a tradução.

source: Packages that only exist in Xubuntu
pt_br: Pacotes que existem apenas no Xubuntu

source: These packages only exist in Xubuntu, so their translation is solely dealt with by Xubuntu translators. These are of high importance for the Xubuntu team.
pt_br: Estes pacotes existem apenas no Xubuntu, a sua tradução é gerida apenas pelos tradutores do Xubuntu. Eles são de alta importância para a equipe do Xubuntu.

source: Xubuntu Documentation
pt_br: Documentação do Xubuntu

source: Xubuntu Default Settings
pt_br: Configurações padrão do Xubuntu

source: Ubiquity Slideshow for Xubuntu
pt_br: Slideshow do Ubiquity para o Xubuntu

source: Used by Xubuntu
pt_br: Usado pelo Xubuntu

source: These packages are used by Xubuntu and provide features to the Xubuntu experience. When these are translated, the base system is immediately more usable for more people.
pt_br: Estes pacotes são usados pelo Xubuntu e fornecem recursos para a experiência Xubuntu. Quando forem traduzidos, o sistema base se torna imediatamente mais usável paras as pessoas.

source: LightDM GTK+ Greeter Settings
pt_br: Configurações do LightDM GTK+ Greeter

source: Translation guidelines for Xubuntu packages
pt_br: Diretrizes de tradução para pacotes do Xubuntu

source: These guidelines apply mostly to the Xubuntu documentation. They can generally be applied to any translation with minor modification. If unsure, ask the Documentation team members for assistance.
pt_br: Estas diretrizes se aplicam principalmente a documentação do Xubuntu. Elas geralmente podem ser aplicadas a qualquer tradução com leve modificações. Se não tiver certeza,peça assistência aos membros da equipe de Documentação.

source: language-specific translation teams
pt_br: Equipes de tradução de linguagens específicas

source: The <_:ulink-1/> usually want to encourage some conventions; please contact the appropriate language-specific team before translating.
pt_br: O <_:ulink-1/>geralmente quer encorajar alguns acordos; por favor contate a equipe de tradução de linguagem específica apropriada antes de traduzir.

source: Launchpad translations guide
pt_br: Guia de traduções do Launchpad

source: More general translation guidelines can be found at the <_:ulink-1/>.
pt_br: Mais diretrizes gerais de tradução podem ser encontradas em <_:ulink-1/>.

source: Maintain translation validity
pt_br: Manter a validade da tradução

source: Tags should not be translated.
pt_br: Tags não devem ser traduzidas

source: <_:emphasis-1/> Where you see a tag in the source string (for example: "&lt;xref linkend="&amp;xubuntu-web;" /&gt;"), the tag and anything inside the tag itself should not be translated. It is very important to copy and paste these tags exactly as they appear in the source string. Note: The exception to this is where a tag contains a URL that has an equivalent, translated version. In those cases the translator should use discretion about whether to localise the URL.
pt_br: <_:emphasis-1/>Quando ver uma tag na string fonte (por exemplo: &lt;xref linkend="&amp;xubuntu-web;"/&gt;"), a tag e qualquer coisa dentro da própria tag não deve ser traduzido. É importante copiar e colar essas tags exatamente como aparecem na string fonte. Observação: a exceção a isso é quando uma tag contém uma URL que possui uma versão equivalente,traduzida. Nesses casos a tradução da URL ficará a critério do tradutor.

source: Entities should not be translated.
pt_br: Entidades não devem ser traduzidas.

source: <_:emphasis-1/> Where you see a phrase expressed like "&amp;gt;" or "&amp;xubuntu-web;", do not change this.
pt_br: <_:emphasis-1/>Quando ver uma frase expressada como "&amp;gt;" ou "&amp;xubuntu-web;", não a altere.

source: Always maintain the order of tags.
pt_br: Sempre mantenha a ordem das tags.

source: <_:emphasis-1/> When you see different tags nested inside each other (for example: "&lt;menuchoice&gt;&lt;guimenu&gt;System&lt;/guimenu&gt;&lt;guimenuitem&gt;Administration&lt;/guimenuitem&gt;&lt;guimenuitem&gt;Users and Groups&lt;/guimenuitem&gt;&lt;/menuchoice&gt;"), you must always preserve that order carefully - copying and pasting from the source language (English) is the best way to ensure that you do this correctly.
pt_br: <_:emphasis-1/>Quando ver tags diferentes agrupadas umas nas outras(por exemplo: "&lt;menuchoice&gt;&lt;guimenu&gt;System&lt;/guimenu&gt;&lt;guimenuitem&gt;Administration&lt;/guimenuitem&gt;&lt;guimenuitem&gt;Users and Groups&lt;/guimenuitem&gt;&lt;/menuchoice&gt;"), você sempre deverá preservar a ordem cuidadosamente - copiando e colando da linguagem original(Inglês) é a melhor maneira de garantir que você faça isso corretamente.

source: Different programming languages and software might have different variable syntaxes; make sure you are familiar with the appropriate software variable syntax when translating. More information on this can often be found in the translation string comment.
pt_br: Linguagens de programação diferentes e software podem ter sintaxes variáveis diferentes: tenha certeza que está familiar com a sintaxe variável apropriada do software ao traduzir. Mais informações podem ser encontradas na string de tradução do comentário.

source: Follow good and existing conventions
pt_br: Siga acordos bons e existentes

source: Use application and label names found in the (graphical) UI.
pt_br: Use os nomes de aplicativo e rótulos encontrado na interface (gráfica).

source: <_:emphasis-1/> When translating UI labels and application names, use the term or name that is used on the graphical UI. This makes it easier for the user to follow the instructions. Running the system in both the translation target language and English can help with this.
pt_br: <_:emphasis-1/>Ao traduzir nomes de aplicativos e rótulos de interface gráficas,use o termo ou nome usado na interface gráfica. Isso facilitará o usuário a seguir as instruções. Executar o sistema tanto na linguagem de tradução predestinada quanto em inglês pode ajudar nisso.

source: Do not change the amount of spacing.
pt_br: Não altere a quantidade de espaçamento.

source: <_:emphasis-1/> When translating, do not change the amount of spacing inside our outside tags. Keeping the spacing as it is makes the technical reviewing of the translation easier.
pt_br: <_:emphasis-1/>Ao traduzir, não altere a quantidade de espaçamento dentro ou fora das tags. Manter o espaçamento como está torna a revisão técnica da tradução mais fácil.

source: Do not change the type of quotes used inside the tags.
pt_br: Não altere o tipo de aspas usadas dentro das tags.

source: <_:emphasis-1/> The double quotes ( " ) doesn't have the same significance in a DocBook, XHTML or XML tag as the guillemets ( « » ). Using different kind of quotes can potentially develop into validity problems as well.
pt_br: <_:emphasis-1/>As aspas duplas ( " ) não possuem a mesma significância em um DocBook, XHTML ou tag XLM como as aspas ( « » ). Usar tipos diferentes de aspas pode levar a problemas de validade também.

source: Never change a tag to another.
pt_br: Nunca altere uma tag para outra.

source: <_:emphasis-1/> If you think a tag in the source is invalid or not semantic, file a bug against the package itself instead of changing it in the translation.
pt_br: <_:emphasis-1/>Se achar que uma tag na fonte é inválida ou não semântica, registre um bug contra o próprio pacote invés de alterá-la na tradução.

source: Working with the documentation
pt_br: Trabalhando com a documentação

source: Editing the documentation
pt_br: Editando a documentação

source: First make sure you have the Bzr branch <_:literal-1/> and the build dependencies for <_:literal-2/>.
pt_br: Primeiro tenha certeza que você tem a branch Bzr <_:literal-1/> e as dependências de compleição para <_:literal-2/>.

source: user-docs/C/
pt_br: documentação-usuário/C/

source: Changes to the user documentation should be made to the .xml files under <_:literal-1/>. Once edited and saved, push changes to your local branch as detailed in <_:xref-2/>.
pt_br: Alterações á documentação do usuário devem ser feitas aos arquivos .xml em <_:literal-1/>. Após editadas e salvas,envie as mudanças a sua branch local como detalhado em <_:xref-2/>.

source: contributor-docs/C/
pt_br: documentação-colaborador/C/

source: Similarly, changes to the contributor documentation should be made to the .xml files under <_:literal-1/>.
pt_br: Similarmente,alterações á documentação do colaborador devem ser feitas aos arquivos .xml em <_:literal-1/>.

source: Notes on the contributor documentation
pt_br: Observações na documentação do colaborador

source: For various reasons, the contributor documentation is more complex in structure than the user documentation. Particularly, pay attention to the following when working with the subteam documentation:
pt_br: Por vários motivos,a documentação do colaborador possui uma estrutura mais complexa que a documentação do usuário. Particularmente,preste atenção ao seguinte quando estiver trabalhando com a sub-equipe de documentação:

source: If you want to create an introductory paragraph that is shown on the subteam main page, simply do not wrap it inside a <_:literal-1/> element. Otherwise this will be chunked into a separate HTML file.
pt_br: Se quiser criar um parágrafo introdutório que seja mostrado na página principal da sub-equipe, simplesmente não o envolva dentro de um <_:literal-1/>elemento. De outra forma ele será fragmentado em um arquivo HTML separado.

source: If you want a subsection of a section to be visible in the Table of Contents, add the <_:literal-1/> attribute for the <_:literal-2/> element. For an actual example, see the <_:literal-3/> files.
pt_br: Se quiser que uma subseção seja visível no índice,adicione o atributo <_:literal-1/>para o elemento <_:literal-2/>. Para um exemplo real, veja os arquivos <_:literal-3/>.

source: The sections are chunked up to the first level; this means all direct <_:literal-1/> ascendants of <_:literal-2/> elements will be chunked into separate HTML files. If you want to avoid this (for example if your chapter is very short), insert the <_:literal-3/> after the <_:literal-4/> element of your chapter. Note that doing this will not stop the Table of Contents from being printed with each section. You can use the <_:literal-5/> element again to hide sections from the Table of Contents. If you do this, make sure you don't insert any elements after the <_:literal-6/> elements in your chapter, as this will invalidate the document.
pt_br: As seções são fragmentadas até o primeiro nível; Isso significa que todos os ascendentes diretos<_:literal-1/> dos elementos <_:literal-2/> serão fragmentados em arquivos HTML separados. Se quiser evitar isso (Se seu capítulo está muito curto por exemplo). Insira o <_:literal-3/>após o <_:literal-4/>elemento do seu capítulo. Observe que fazer isso não irá impedir o Índice de ser estampado em cada seção. Você pode usar o <_:literal-5/>elemento novamente para ocultar seções do Índice. Se fizer isso,tenha certeza que você não insira quaisquer elementos após os elementos <_:literal-6/>em seu capítulo, já que isso invalidará o documento.

source: Documentation
pt_br: Documentação

source: The Xubuntu documentation oversees the user documentation and contributor documentation as translations for the documentation and other packages important to Xubuntu. In addition the team works together with other teams in producing content and more.
pt_br: A documentação do Xubuntu supervisiona a documentação do usuário e documentação do colaborador como traduções a documentação e outros pacotes importantes para o Xubuntu. Além disso a equipe trabalha junto de outras equipes na produção de conteúdo e mais.

source: Getting Started
pt_br: Introdução

source: Important Places
pt_br: Locais importantes

source: The IRC channel #xubuntu-devel is where most of the daily communication and cooperation about Xubuntu development happens. It's also the place to get to know people and get yourself known.
pt_br: O canal IRC #xubuntu-devel é onde a maioria da comunicação e cooperação diária sobre o desenvolvimento do Xubuntu acontece. também é o lugar de conhecer pessoas e se tornar conhecido.

source: Status Tracker
pt_br: Rastreador de Status

source: The development for the current Xubuntu release is tracked in the <ulink url="http://dev.xubuntu.org/">Xubuntu development tracker</ulink>. In addition to showing the current status for blueprints and their individual work items, the tracker displays some general progress. Finally, you can access the team calendar, Xubuntu wiki, development mailing list and join the development IRC channel #xubuntu-devel from it.
pt_br: O desenvolvimento da versão atual do Xubuntu é rastreada no rastreador de desenvolvimento Xubuntu<ulink url="http://dev.xubuntu.org/">. Além de exibir o status atual para diagramas e seus itens de trabalho individuais,o rastreador exibe algum do progresso geral. Finalmente, você pode acessar o calendário do time,Xubuntu Wiki,lista de e-mails de desenvolvimento e se juntar ao canal IRC de desenvolvimento #xubuntu-devel através dele.

# _
source: translator-credits
pt_br: Julio Cezar <juliocezar426@gmail.com>, 2024

source: Xubuntu Contributor Documentation
pt_br: Documentação de colaborador do Xubuntu

source: Credits and License
pt_br: Créditos e Licença

source: This documentation is maintained by the Xubuntu documentation team.
pt_br: Essa documentação é mantida pela equipe de documentação do Xubuntu.

source: The contributors to this documentation are:
pt_br: Os colaboradores para essa documentação são:

source: This document is made available under the Creative Commons ShareAlike 2.5 License (CC-BY-SA).
pt_br: Este documento está disponível sobre os termos da licença Creative Commons ShareAlike 2.5 License (CC-BY-SA).

source: You are free to modify, extend, and improve the Ubuntu documentation source code under the terms of this license. All derivative works must be released under this license.
pt_br: Você pode modificar, estender e melhorar o código fonte da documentação do Ubuntu sob os termos desta licença. Todos os trabalhos derivados devem ser liberados sob esta licença.

source: This documentation is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE AS DESCRIBED IN THE DISCLAIMER.
pt_br: Esta documentação é distribuída na expectativa de que será útil, mas SEM NENHUMA GARANTIA; até mesmo sem a garantia de COMERCIALIZAÇÃO ou de ADEQUAÇÃO A UM PROPÓSITO EM PARTICULAR, CONFORME DESCRITO NO TERMO DE RESPONSABILIDADE.

source: A copy of the license is available here: <link linkend="cc-by-sa">Creative Commons ShareAlike License</link>.
pt_br: Uma cópia da licença está disponível aqui: <link linkend="cc-by-sa">Creative Commons ShareAlike License </link>.

source: All trademarks or registered trademarks are the property of the respective owners.
pt_br: Todas as marcas comerciais ou registradas são de propriedade dos seus respectivos donos.

source: <year>2015–2020</year> <holder>The Xubuntu documentation team. Xubuntu and Canonical are registered trademarks of Canonical Ltd.</holder>
pt_br: <year>2015-2020</year> <holder>Time de documentação do Xubuntu. Xubuntu e Canonical são marcas registradas da Canonical Ltd.</holder>

source: The Xubuntu documentation team
pt_br: Time de documentação do Xubuntu

source: Welcome!
pt_br: Bem-vindo!

source: This documentation is a reference for all Xubuntu contributors. The chapters of this documentation provides information on the development processes - both social and technical - that the Xubuntu contributors use as a guideline in their work.
pt_br: Esta documentação é uma referência a todos colaboradores do Xubuntu. Os capítulos desta documentação fornecem informação sobre os processos de desenvolvimento - tanto sociais quanto técnicos - que os colaboradores do Xubuntu usam como uma diretriz em seu trabalho.

source: There are two main appendices for this documentation:
pt_br: Existem dois apêndices principais para esta documentação:

source: <xref linkend="xsd"/>, which is the primary guideline in Xubuntu development.
pt_br: <xref linkend="xsd"/>,que é a diretriz primária no desenvolvimento do Xubuntu.

source: <xref linkend="common-reference"/>, which describes many technical tasks that the Xubuntu developers need to use continuously.
pt_br: <xref linkend="common-reference"/>, que descreve várias tarefas técnicas que os desenvolvedores do Xubuntu precisam usar continuamente.

source: This documentation is written with the assumption that the user knows the basics of working with Xubuntu. For example, it's expected that the reader knows how to work with a terminal and understand when they need to use one, without an explicit mention.
pt_br: Esta documentação é escrita com a suposição que o usuário conhece as noções básicas de trabalhar com o Xubuntu. Por exemplo,espera-se que o leitor saiba como trabalhar usando um terminal e entenda quando precisar de usar um,sem uma menção explícita.

source: Subteam Documentation
pt_br: Documentação da Sub-equipe

source: Release Cycle
pt_br: Ciclo de Lançamento

source: This section loosely describes the stages of a development and release cycle.
pt_br: Esta seção descreve vagamente os estágios de desenvolvimento e ciclo de lançamento.

source: Planning
pt_br: Planejamento

source: Planning the release is conducted in three phases:
pt_br: O planejamento da liberação é realizado em três fases:

source: Brainstorming
pt_br: Discussão de idéias

source: Approving blueprints
pt_br: Aprovando diagramas

source: Finalizing specifications
pt_br: Finalizando especificações

source: During the brainstorming phase the contributors determine what they would like to work on during the release cycle, including proposals for changes in default applications. Anybody can add items to the list. Settling on the goals in advance will make planning, focusing and estimating the likelihood for the features to be implemented easier.
pt_br: Durante a fase de discussão de idéias os colaboradores determinam no que eles gostariam de trabalhar durante o ciclo de lançamento, incluindo propostas de alterações nos aplicativos padrão. Qualquer pessoa pode adicionar itens na lista. Definindo os objetivos com antecedência tornará o planejo,foco e estimação de probabilidade das funções a serem implementadas mais fácil.

source: After the brainstorming is over and before or on the Feature Definition Freeze day, the Xubuntu team will approve or reject the proposed blueprints. Any items with no assignee or rationale will be automatically rejected, but having them will not guarantee that the blueprint is approved. Other criteria include, but are not limited to: likelihood of getting the feature implemented, maintenance weight in the future, possible stability issues, influence on other blueprints, et cetera. The approved blueprints compose the roadmap for the release being developed.
pt_br: Após o término da discussão de idéias e antes ou durante o dia de Freeze da definição de funções, a equipe do Xubuntu irá aprovar ou rejeitar os diagramas propostos. Qualquer item com nenhum cessionário ou justificativa será automaticamente rejeitado, mas ter ambos não irá garantir que o diagrama seja aprovado. Outros critérios incluem,mas não estão limitados a: probabilidade de ter a função implementada,peso de manutenção no futuro,possíveis problemas de estabilidade, influência em outros diagramas,etc. Os diagramas aprovados compõem o quadro de referência para a versão sendo desenvolvida.

source: After blueprints are approved, they should be finalized and detailed specifications should be written. These specifications should document the proposed changes and help guide the implementation.
pt_br: Após diagramas serem aprovados,eles devem ser finalizados e especificações detalhadas devem ser escritas. Essas especificações devem documentar as alterações propostas e ajudar a orientar a implementação.

source: Once the detailed specifications are ready, the developer team should coordinate with the QA team about the required scale and schedule of testing. The QA team will then build a schedule for testing for ISO and package tests. Additional requests for testing during the cycle should be sent out only after consulting the QA team.
pt_br: Uma vez que as especificações detalhadas estejam prontas,a equipe de desenvolvedores deverá coordenar com a equipe de controle de qualidade sobre a escala requirida e o horário de testes. A equipe de controle de qualidade irá então montar um horário para o teste da ISO e testes de pacotes. Solicitações adicionais para testes durante o ciclo de desenvolvimento devem ser enviadas apenas após consultar a equipe de controle de qualidade.

source: The Ubuntu freezes define the deadlines for implementation.
pt_br: Os freezes do Ubuntu definem o prazo final para implementação.

source: Developing
pt_br: Em desenvolvimento

source: In addition to implementing the features and/or improvements set in the roadmap, there are a number of tasks which will occur during each release cycle:
pt_br: Além da implementação de funções e/ou melhorias definidas no quadro de referência,há uma série de tarefas que irão ocorrer durante cada ciclo de lançamento.

source: Xubuntu packages will be synced or merged with Debian as appropriate
pt_br: Pacotes do Xubuntu serão sincronizados ou mesclados com o Debian como apropriado

source: Bugs reported by users will be reviewed, fixed, and/or passed upstream
pt_br: Bugs relatados pelos usuários serão analisados,consertados, e/ou levados ao upstream

source: Attempt to reduce our delta by pushing appropriate patches upstream
pt_br: Tente reduzir nosso delta ao enviar patches apropriados ao upstream

source: Evaluate the seeds to ensure we are shipping the optimal software
pt_br: Avalie as seeds para garantir que estamos entregando o software ideal

source: Work on improving and updating the Xubuntu documentation and artwork
pt_br: Trabalhe em melhorar e atualizar a documentação e ilustrações do Xubuntu

source: Testing
pt_br: Testes

source: Throughout the release cycle and even more so towards the end, we will test Xubuntu to ensure that Xubuntu is a quality product that we are proud of.
pt_br: Por todo o ciclo de lançamento e ainda mais no final, nós iremos testar o Xubuntu para garantir que Xubuntu é um produto de qualidade do qual estamos orgulhosos.
