Repository: Xubuntu-Team/xubuntu-docs
Catalog: contributor-docs/po/*.po
Languages: pt_br

source: Common Reference
pt_br: Referência Comum

source: Using Bazaar (Bzr)
pt_br: Usando Bazaar (Bzr)

source: Bazaar (commonly referred to as Bzr) is the version control system primarily used in Xubuntu development.
pt_br: Bazaar (comumente referido como Bzr) é o sistema de controle de versão usado principalmente no desenvolvimento do Xubuntu.

source: Setting up Bzr
pt_br: Configurando o Bzr

source: To set up Bzr, do the following:
pt_br: Para configurar Bzr, faça o seguinte:

source: To make sure Bzr is installed on your system, run <_:userinput-1/>
pt_br: Para ter certeza que Bzr está instalado em seu sistema, execute <_:userinput-1/>

source: To set up your personal information for Bzr to use, run <_:userinput-1/>
pt_br: Para configurar suas informações pessoais para usar no Bzr, execute <_:userinput-1/>

source: Getting and updating Bzr branches
pt_br: Obtendo e atualizando branches do Bzr

source: bzr branch LOCATION
pt_br: bzr branch LOCALIZAÇÃO

source: After you have set up Bzr, you can get a local copy of a branch by running <_:userinput-1/>. This will create a directory for the branch.
pt_br: Depois que você configurar Bzr, você pode obter uma cópia local de uma branch <_:userinput-1/>. Isto irá criar um diretório para a branch.

source: To make sure your local copy is up to date, run <_:userinput-1/> inside the branch directory.
pt_br: Para ter certeza que sua cópia local está atualizada, execute <_:userinput-1/> dentro do diretório da branch.

source: Pushing to Bzr branches
pt_br: Enviando por Push para repositórios Bzr

source: When you have worked on your changes and want to push them to a remote branch, do the following in the local branch:
pt_br: Quando tiver trabalhado em suas alterações e quiser movê-las a uma branch remota, faça o seguinte na branch local:

source: bzr mv OLD NEW
pt_br: bzr mv ANTIGO NOVO

source: To rename or move files, run <_:userinput-1/>. This helps to keep the resulting diff meaningful, and also works after the fact.
pt_br: Para renomear ou mover arquivos, execute<_:userinput-1/>. Isso ajudará manter o diff resultante significativo, e também funcionará após o fato.

source: If you have added files, run <_:userinput-1/> in the branch root. This starts tracking any files in the branch that are currently unknown.
pt_br: Se tiver adicionado arquivos, execute<_:userinput-1/>na branch root. Isto iniciará o rastreio de quaisquer arquivos na filial que estão indeterminados no momento.

source: If you have removed files, run <_:userinput-1/>. In most cases, this should automatically stop tracking files that are no longer in the branch.
pt_br: Se tiver removido arquivos, execute<_:userinput-1/>.Na maioria dos casos,isso deverá automaticamente parar o rastreio de arquivos que não estão mais na branch.

source: To check the status of the branch, run <_:userinput-1/>.
pt_br: Para verificar o estado da branch, execute <_:userinput-1/>.

source: Commit your changes by running <_:userinput-1/>. This will open a text editor to enter the commit message.
pt_br: Faça o commit das suas alterações ao executar<_:userinput-1/>.Isto irá abrir um editor de texto para inserir a mensagem de confirmação.

source: bzr push LOCATION
pt_br: bzr push LOCALIZAÇÃO

source: After you have done one or more commits, run <_:userinput-1/> to push your changes to a remote branch.
pt_br: Após ter feito um ou dois commits, execute<_:userinput-1/>para mover suas alterações a uma branch remota.

source: -m MESSAGE
pt_br: -m MENSAGEM

source: --fixes lp:BUGNO
pt_br: --fixes lp:NÚMERODOBUG

source: The commit message should summarize all the changes you have done after the last commit. You can specify it directly by using <_:literal-1/>, and link a bug report to the commit by using <_:literal-2/>.
pt_br: A mensagem de commit deverá resumir todas as alterações que você fez após o último commit.Você pode especificá-la usando<_:literal-1/>,e vincular um reporte de bug ao commit usando <_:literal-2/>.

source: When you are working on a branch and are making several changes that aren't related to each other, it is recommended that you do several commits. This helps to keep the commit log clean and makes it easier to find any issues that certain changes may have introduced.
pt_br: Quando estiver trabalhando em uma branch e fazendo várias alterações que não são relacionadas umas as outras,é recomendado fazer vários commits. Isso ajuda manter o log de commits limpo e torna mais fácil a procura de qualquer problema que possa ter sido introduzido.

source: <_:inlinemediaobject-1/>lp:~username/projectname/branchname
pt_br: <_:inlinemediaobject-1/>lp:~usuário/nome_do_projeto/nome_da_branch

source: When you push to a remote branch the first time, you will need to specify the branch location. In most cases, it will follow the format <_:literal-1/>. This pushes your code to a personal remote branch. On subsequent pushes, you can omit the branch location, as Bzr will have saved your previous push location in the local branch configuration.
pt_br: Quando mover uma alteração para uma branch remota pela primeira vez, terá que especificar a localização da branch, Na maioria dos casos,ela irá seguir o formato <_:literal-1/>. Isso moverá o seu código para uma branch remota pessoal, Ao mover alterações repetidamente, você poderá omitir a localização da branch, já que Bzr terá salvo a localização mais recente na configuração da branch local.

source: Submitting merge proposals
pt_br: Enviando propostas de mesclagem

source: Once you have pushed your changes to a personal branch, you might want to propose them to be merged into the main branch.
pt_br: Quando tiver movido suas alterações para uma branch pessoal,poderá querer propor que elas sejam mescladas na branch principal.

source: your Launchpad branches
pt_br: suas branches do Launchpad

source: Propose for merging
pt_br: Propor a mesclagem

source: To do a merge proposal (often referred to as MP) via web browser, start by opening the Launchpad page of your branch. You can find it by going to <_:ulink-1/> page and clicking on the branch in question. Now, click on <_:guilabel-2/>. This will open a page that asks for some details on the merge proposal you are about to do.
pt_br: Para fazer um merge proposal(muitas vezes referido como MP) pelo navegador,comece abrindo a página Launchpad de sua branch. Pode encontrá-la indo na página <_:ulink-1/>e clicando na branch em questão. Agora,clique em <_:guilabel-2/>. Isto abrirá uma página que pedirá alguns detalhes no merge proposal que você está prestes a fazer.

source: Target Branch
pt_br: Branch alvo

source: Reviewer
pt_br: Revisor

source: Description
pt_br: Descrição

source: The <_:guilabel-1/> is usually set correctly by default, change this only if you know it is wrong. If you have been told to add a specific <_:guilabel-2/>, add that reviewer to the appropriate field. Enter a <_:guilabel-3/> of your proposed change as well. If in doubt about any of the options, ask the requested reviewer, or if one isn't specified, in the IRC channel.
pt_br: O <_:guilabel-1/>é normalmente definido corretamente por padrão,altere isso apenas se você souber que está errado.Se foi dito para adicionar um específico<_:guilabel-2/>, adicione o revisor ao campo apropriado.Introduza um <_:guilabel-3/>de sua alteração propositada também. Se estiver com dúvidas sobre qualquer uma das opções,pergunte ao revisor requisitado,se um não for especificado,pergunte no canal IRC.

source: Propose Merge
pt_br: Propor mesclagem

source: Finally, click on <_:guibutton-1/>. This submits your merge proposal and the target branch's owner as well as the specified reviewers will be sent a mail. If they need further information or want you to work further on the branch, they will comment on the merge proposal. You will be sent a mail any time an action is taken on the merge proposal, including when it's approved and merged into the main branch.
pt_br: Finalmente,clique em <_:guibutton-1/>.Isso irá enviar o seu merge proposal e tanto o dono da branch predestinada e os revisores especificados receberão um email.Se eles precisarem de outras informações ou que você trabalhe mais na branch,eles comentarão no merge proposal. Você receberá um email no momento que uma ação é tomada no merge proposal,incluindo quando for aprovado e mesclado na branch principal.

source: --review NAME
pt_br: --review NOME

source: To do a merge proposal from the command line, using both the remembered submit branch (defaults to the parent branch) and the default reviewer team for that branch, run <_:userinput-1/>. This will open a text editor to enter the description of your proposed change. You can override the default reviewer by using <_:literal-2/> one or more times, and link a bug report to the merge proposal by using <_:literal-3/>.
pt_br: Para fazer um merge proposal pela linha de comando,usando a branch escolhida para o envio(a branch parente é o padrão) e o time de revisores padrão daquela branch,execute<_:userinput-1/>.Isto irá abrir um editor de texto para inserir a descrição de sua alteração proposta. Você pode sobrepor o revisor padrão usando<_:literal-2/>um ou mais vezes,e vincular um reporte de bug ao merge proposal usando <_:literal-3/>.

source: Using Git
pt_br: Usando Git

source: Git is the version control system used in Xfce development.
pt_br: Git é o sistema de controle de versão usado no desenvolvimento do Xfce.

source: One major difference between Git and Bazaar to note is that, in Bazaar you usually deal only with branches, while in Git you have to differentiate between branches and repositories, which can hold multiple branches. This is also reflected by the various commands you use. Another is that Git doesn't automatically stage your changes for commit, you have to tell it to do so.
pt_br: Uma grande diferença a ser observada entre Git e Bazaar,no Bazaar você normalmente lida apenas com branches,enquanto no Git você diferenciar entre branches e repositórios,que podem incluir várias branches. Isso também se reflete nos vários comandos que você usa. Outra diferença é que o Git não irá preparar as suas alterações automaticamente para um commit, você deve dizê-lo a fazer isso.

source: Setting up Git
pt_br: Configurando o Git

source: To set up Git, do the following:
pt_br: Para configurar o Git,faça o seguinte:

source: To make sure Git is installed on your system, run:
pt_br: Para ter certeza que Git está instalado em seu sistema, execute:

source: To set up your personal information for Git to use, run:
pt_br: Para configurar as suas informações pessoais para usar no Git,execute:

source: Getting and updating Git repositories
pt_br: Obtendo e atualizando repositórios do Git

source: git clone LOCATION
pt_br: git clone LOCALIZAÇÃO

source: After you have set up Git, you can get a local copy of a repository by running <_:userinput-1/>. This will create a directory for the repository.
pt_br: Após configurar o Git,você pode obter uma cópia local de um repositório ao executar <_:userinput-1/>. Isso irá criar um diretório para o repositório.

source: To make sure your local copy of a branch is up to date, run <_:userinput-1/> inside the branch directory.
pt_br: Para ter certeza de que a sua cópia local de uma branch está atualizada, execute<_:userinput-1/>dentro do diretório da branch.

source: Pushing to Git repositories
pt_br: Enviando a repositórios Git

source: When you have worked on your changes and want to push them to a remote repository, do the following in the local branch:
pt_br: Quando tiver trabalhado em suas alterações e quiser movê-las a um repositório remoto, faça o seguinte na branch local:

source: git mv OLD NEW
pt_br: git mv ANTIGO NOVO

source: To rename or move files, run <_:userinput-1/>. This helps to keep the resulting diff meaningful, while Git should figure this out automatically.
pt_br: Para renomear ou mover arquivos, execute<_:userinput-1/>. Isso ajudará manter o diff resultante significativo,enquanto Git deverá descobrir isto automaticamente.

source: git rm FILE
pt_br: git rm ARQUIVO

source: To remove files, run <_:userinput-1/>. This also stops tracking the specified files, while it's redundant if all changes are staged later anyway.
pt_br: Para remover arquivos, execute<_:userinput-1/>. Isso também impede o rastreio de arquivos especificados,embora seja redundante se todas as alterações estão preparadas para depois.

source: If you have added files, run <_:userinput-1/> in the branch root. This starts tracking any files in the branch that aren't currently, and also stages any changes.
pt_br: Se tiver adicionado arquivos, execute<_:userinput-1/>no diretório root da branch. Isto iniciará o rastreio de quaisquer arquivos ainda não rastreados, e também preparará quaisquer alterações.

source: Commit your changes by running <_:userinput-1/>. This stages any changes, and will open a text editor to enter the commit message.
pt_br: Faça o commit das suas alterações ao executar <_:userinput-1/>. Isto irá preparar qualquer alteração,e irá abrir um editor de texto para inserir a mensagem de confirmação.

source: git push LOCATION BRANCH
pt_br: git push LOCALIZAÇÃO BRANCH

source: After you have done one or more commits, run <_:userinput-1/> to push your changes to a remote repository.
pt_br: Após ter feito um ou mais commits, execute<_:userinput-1/> para mover suas alterações a um repositório remoto.

source: The commit message should summarize all the changes you have done after the last commit, you can specify it directly by using <_:literal-1/>.
pt_br: A mensagem de commit deverá resumir todas as alterações que você fez após o último commit. Você pode especificá-la diretamente usando <_:literal-1/>.

source: Build dependencies
pt_br: Dependências da compilação

source: Before you can build a package from source, you will usually need to install its build dependencies.
pt_br: Antes de você compilar um pacote da fonte, você normalmente precisará instalar suas dependências de compilação.

source: sudo apt-get build-dep PACKAGE
pt_br: sudo apt-get build-dep PACOTE

source: To do this, simply run <_:userinput-1/>.
pt_br: Para fazer isso, basta executar <_:userinput-1/>.

source: support for Git
pt_br: suporte ao Git

source: Launchpad is the primary platform used for Xubuntu development. Historically, the version control system used on Launchpad is Bazaar, but it recently added <_:ulink-1/>, too.
pt_br: Launchpad é a plataforma principal usada no desenvolvimento do Xubuntu. Historicamente, o sistema de controle de versão usado no Launchpad é o Bazaar,mas recentemente o <_:ulink-1/> foi adicionado, também.

source: Setting up a Launchpad account
pt_br: Configure uma conta na Launchpad

source: Creating a new account
pt_br: Criando uma nova conta

source: For information on setting up a Launchpad account, see <_:ulink-1/>.
pt_br: Para informações sobre como configurar uma conta Launchpad, veja <_:ulink-1/>.

source: Useful QA Links
pt_br: Links úteis de perguntas e respostas

source: Xubuntu Testers
pt_br: Testadores do Xubuntu

source: ISO Tracker
pt_br: Rastreador de ISO

source: Package Tracker
pt_br: Rastreador de pacotes

source: Ubuntu QA Team Wiki
pt_br: Equipe de documentos do Ubuntu QA

source: Ubuntu Manual Tests
pt_br: Manual de testes do Ubuntu

source: Development
pt_br: Desenvolvimento

source: Xubuntu packageset
pt_br: Conjunto de pacotes do Xubuntu

source: The Xubuntu team maintains a subset of packages in the Ubuntu archive. The Xubuntu packageset for the current development release can be found listed at the packageset <ulink url="http://people.canonical.com/~ubuntu-archive/packagesets/">archive</ulink>.
pt_br: A equipe do Xubuntu mantêm um subconjunto de pacotes no arquivo do Ubuntu. O conjunto de pacotes do Xubuntu para a versão em desenvolvimento atual pode ser achado listado no <ulink url="http://people.canonical.com/~ubuntu-archive/packagesets/">arquivo</ulink>.

source: Development PPAs
pt_br: PPAs de desenvolvimento

source: The Xubuntu developers use several PPAs (personal package archives) for staging, testing and previewing new packages and package versions. These PPAs can be found under the <ulink url="https://launchpad.net/~xubuntu-dev">Xubuntu Developers</ulink> page on Launchpad.
pt_br: Os desenvolvedores do Xubuntu usam vários PPAs (arquivos de pacotes pessoais) para a preparar,testar e prever novos pacotes e versões de pacotes. Esses PPAs podem ser encontrados sobre a página <ulink url="https://launchpad.net/~xubuntu-dev">Desenvolvedores do Xubuntu no Launchpad.

source: Currently, the official PPAs for development use are:
pt_br: No momento,os PPAs oficiais usados para desenvolvimento são:

source: <ulink url="https://launchpad.net/~xubuntu-dev/+archive/ubuntu/ppa">Xubuntu Daily Builds</ulink>
pt_br: <ulink url="https://launchpad.net/~xubuntu-dev/+archive/ubuntu/ppa">Builds diárias do Xubuntu</ulink>

source: Git/Bzr daily builds for packages related to Xubuntu and/or Xfce4.
pt_br: Builds diárias Git/Bzr para pacotes relacionados ao Xubuntu e/ou Xfce4.

source: <ulink url="https://launchpad.net/~xubuntu-dev/+archive/ubuntu/experimental">Xubuntu QA Experimental</ulink>
pt_br: <ulink url="https://launchpad.net/~xubuntu-dev/+archive/ubuntu/experimental">Controle de qualidade experimental do Xubuntu</ulink>

source: An experimental PPA for Xubuntu. The packages and package versions in this PPA are being prepared for inclusion in Xubuntu. The packages are uploaded for the convenience of people testing these new package versions and features. Some of them are daily builds used in testing.
pt_br: Um PPA experimental para o Xubuntu. Os pacotes e versões de pacotes neste PPA estão sendo preparados para inclusão no Xubuntu. Os pacotes são enviados para a conveniência das pessoas testando essas novas versões de pacotes e funções. Alguns deles são builds diárias usadas em testes.

source: <ulink url="https://launchpad.net/~xubuntu-dev/+archive/ubuntu/xubuntu-staging">Xubuntu QA Staging</ulink>
pt_br: <ulink url="https://launchpad.net/~xubuntu-dev/+archive/ubuntu/xubuntu-staging">Preparação do controle de qualidade do Xubuntu</ulink>

source: A staging PPA for Xubuntu, often used for SRU preparation. The packages and package versions in this PPA are being prepared for inclusion in Xubuntu. The packages are uploaded for the convenience of people testing these new package versions and features. Some of them are daily builds used in testing.
pt_br: Um PPA de preparação para o Xubuntu, normalmente usado para a preparação SRU. Os pacotes e versões de pacotes neste PPA estão sendo preparados para a inclusão no Xubuntu. Os pacotes são enviados para a conveniência das pessoas testando essas novas versões de pacotes e funções. Alguns deles são builds diárias usadas em testes.

source: A preview PPA for Xubuntu. The packages in this PPA are considered for inclusion in the Ubuntu repositories and/or Xubuntu at a later time. The packages are uploaded for the convenience of people willing to preview the new features.
pt_br: Um PPA de visualização para o Xubuntu. Os pacotes neste PPA são considerados para a inclusão nos repositórios do Ubuntu e/ou Xubuntu posteriormente. Os pacotes são enviados para a conveniência das pessoas dispostas a visualizar as novas funções.

source: Tasks
pt_br: Tarefas

source: User documentation
pt_br: Documentação do usuário

source: The documentation team works with the developers to ensure any new features that are part of the core functionality of the operating system are covered in the documentation. In addition, the documentation team makes sure features highlighted in the installer slideshow or any other marketing material are appropriately documented. When completely new sections are written, the documentation team makes sure the Xubuntu team has a chance to review and propose changes and fixes to the new sections. When any documented features are removed or changed, the team makes sure the documentation does not refer to any removed functionality.
pt_br: A equipe de documentação trabalha com os desenvolvedores para garantir que quaisquer novas funções essenciais a funcionalidade do sistema operacional sejam abordadas na documentação. Além disso,a equipe de documentação garante que funções destacadas no slideshow do instalador ou qualquer outro material de marketing sejam devidamente documentadas. Quando seções completamente novas são escritas,a equipe de documentação garante que a equipe do Xubuntu tenha a chance de revisar e propor mudanças e soluções as novas seções. Quando qualquer função documentada é removida ou alterada, a equipe garante que a documentação não refira a qualquer funcionalidade removida.

source: The team should be aware of changes to new releases, particularly on LTS releases and potential SRUs, as those might affect documentation.
pt_br: A equipe deve estar ciente de alterações a novas versões,particularmente das versões LTS e potenciais SRUs, pois elas podem afetar a documentação.

source: online documentation
pt_br: documentação online

source: The documentation team is responsible for making sure the documentation is updated before the Documentation String Freeze prior to uploading. Once the upload is done, the team coordinates translation efforts and makes sure the documentation gets another upload before the Translation Freeze. The team should also request the <_:ulink-1/> to be updated shortly before the release.
pt_br: A equipe de documentação é responsável por garantir que a documentação está atualizada antes do Freeze da String de Documentação para o envio. Assim que o upload for concluído, a equipe coordena esforços de tradução e garante que a documentação receba outro upload antes do Freeze da Tradução. A equipe também deverá solicitar que <_:ulink-1/> seja atualizada pouco antes do lançamento.

source: The documentation team should also look to improve and expand the existing documentation, especially during the development cycles when most uploads are done for maintenance purposes. The team should involve the community in these efforts the best way they see fit.
pt_br: A equipe de documentação também deve procurar melhorar e expandir a documentação existente, especialmente durante os ciclos de desenvolvimento quando a maioria dos uploads são feitos para propósitos de manutenção. A equipe deverá envolver a comunidade nesses esforços da maneira que acharem melhor.

source: Contributor documentation
pt_br: Documentação do colaborador

source: The documentation team lead the efforts to write the contributor documentation. While the various subteams are responsible for their own sections, the documentation team should help the teams to get their content pushed to the main branch and where needed, help contributors to format the content in the DocBook markup.
pt_br: A equipe de documentação lidera os esforços para escrever a documentação do colaborador. Enquanto as várias sub-equipes são responsáveis por suas próprias seções, a equipe de documentação deverá ajudar as equipes a ter o seu conteúdo enviado a branch principal e quando necessário, ajudar os colaboradores a formatar o conteúdo na marcação DocBook.

source: online contributor documentation
pt_br: Documentação online do colaborador

source: The <_:ulink-1/> should be kept updated especially when major changes are made; the documentation team should request an update whenever they see fit.
pt_br: O <_:ulink-1/>deverá ser mantido atualizado especialmente quando grandes mudanças são feitas: a equipe de documentação deverá solicitar uma atualização sempre que acharem adequado.

source: Other tasks
pt_br: Outras tarefas

source: In addition to the above, the documentation team is strongly encouraged to do the following:
pt_br: Além do acima,a equipe de documentação é fortemente encorajada a fazer o seguinte:
