Repository: Xubuntu-Team/xubuntu-docs
Catalog: contributor-docs/po/*.po
Languages: pt_br

source: The source code for the website is available at <literal><inlinemediaobject role="icon-branch"><imageobject><imagedata role="icon-pad" fileref="../../libs-common/images/icon_branch.png"/></imageobject></inlinemediaobject>lp:xubuntu-website</literal> (the theme) and <literal><inlinemediaobject role="icon-branch"><imageobject><imagedata role="icon-pad" fileref="../../libs-common/images/icon_branch.png"/></imageobject></inlinemediaobject>lp:xubuntu-website/plugins</literal> (the plugins).
pt_br: O código fonte do website está disponível em <literal><inlinemediaobject role="icon-branch"><imageobject><imagedata role="icon-pad" fileref="../../libs-common/images/icon_branch.png"/></imageobject></inlinemediaobject>lp:xubuntu-website</literal>(o tema) e <literal><inlinemediaobject role="icon-branch"><imageobject><imagedata role="icon-pad" fileref="../../libs-common/images/icon_branch.png"/></imageobject></inlinemediaobject>lp:xubuntu-website/plugins</literal>(os plugins).

source: <emphasis>The Xubuntu wiki is used for some developer communication and serves as an archive for older release roadmaps and specification.</emphasis>
pt_br: <emphasis> A Xubuntu wiki é usada para algumas comunicações entre desenvolvedores e serve como um repositório de antigos quadros de referência de versão e especificações.</emphasis>

source: Xubuntu website maintenance documentation
pt_br: Documentação de manutenção do website do Xubuntu

source: Releases
pt_br: Lançamentos

source: The Xubuntu website tracks releases with a custom WordPress taxonomy. The release terms can be attached to virtually any content type used on the website. The release term information and attached content are used to automatize some content creation on the website, including but not necessarily limited to: the <ulink url="https://xubuntu.org/releases">release pages</ulink>, the <ulink url="https://xubuntu.org/getxubuntu/">Download page</ulink>, the <ulink url="https://xubuntu.org/help/">Help &amp; Support</ulink> page and the <ulink url="https://xubuntu.org/press/">In the Press</ulink> page.
pt_br: O site do Xubuntu rastreia lançamentos com uma taxonomia personalizada do WordPress. Os termos de lançamento podem ser anexados virtualmente para qualquer tipo de conteúdo usado no site. Informações do termo de lançamento e conteúdo anexado são usados para automatizar a criação de algum conteúdo no site, incluindo, mas não necessariamente limitado, a: <ulink url="https://xubuntu.org/releases"> páginas de lançamento </ulink>, <ulink url="https://xubuntu.org/getxubuntu/"> página de Download </ulink>, página de <ulink url="https://xubuntu.org/help/"> Ajuda e Suporte </ulink> e a página <ulink url="https://xubuntu.org/press/"> Na Imprensa </ulink>.

source: To edit the generic information for each release (codename, release date, EOL date, links for Torrent downloads and online documentation and release switch), go to <ulink url="https://xubuntu.org/wp-admin/edit-tags.php?taxonomy=release">Posts – Releases</ulink>.
pt_br: Para editar a informação genérica de cada lançamento (nome de código, data de lançamento, data do EOL, links para downloads de torrents, documentação online e alternância de lançamento), vá para <ulink url="https://xubuntu.org/wp-admin/edit-tags.php?taxonomy=release"> Postagens – Lançamentos </ulink>.

source: To attach any content to a release, select the desired release(s) on the content edit page.
pt_br: Para anexar qualquer conteúdo a uma versão, selecione as versões desejadas na página de edição de conteúdo.

source: The following shortcodes are used to output aggregated release information (replace <literal>xx-xx</literal> with the desired release slug):
pt_br: Os seguintes códigos de acesso são usados para gerar informações agregadas sobre lançamentos (substituir <literal>xx-xx</literal>pelos dados do lançamento desejado):

source: <userinput>[torrents release=xx-xx]</userinput> to output Torrent download links
pt_br: <userinput>[torrents release=xx-xx]</userinput>para produzir links de download Torrent

source: <userinput>[mirrors release=xx-xx]</userinput> to output the mirror download link list with extended information available
pt_br: <userinput>[mirrors release=xx-xx]</userinput> para produzir lista de links de download de mirrors com informação estendida disponível

source: <userinput>[press release=xx-xx]</userinput> to output all press links attached to the release and <userinput>[press]</userinput> to output the press archive
pt_br: <userinput>[press release=xx-xx]</userinput>para produzir todos os links de imprensa anexados ao lançamento e <userinput>[pressione]</userinput> para produzir o arquivo de imprensa

source: <userinput>[documentation_links]</userinput> to output a list with links to the online documentation for all released and supported releases
pt_br: <userinput>[documentation_links]</userinput> para produzir uma lista com links para a documentação online para todas as versões lançadas e suportadas

source: The releases landing page uses the page template of the same name; the template lists all released and supported releases with their short descriptions. The release pages are created automatically.
pt_br: A página de lançamento das versões usa uma página modelo com o mesmo nome; o modelo lista todas as versões lançadas e suportadas com uma pequena descrição. As páginas de lançamento são criadas automaticamente.

source: Release links
pt_br: Links de lançamento

source: To add press links (and other official release-specific links apart from Torrent download links and links to online documentation), go to <ulink url="https://xubuntu.org/wp-admin/post-new.php?post_type=release_link">Release Links</ulink>. Once added to the database, links will appear in the appropriate places automatically.
pt_br: Para adicionar links de imprensa ( e outros links oficiais de versões específicas além dos links de download Torrent e links para a documentação online), vá para <ulink url="https://xubuntu.org/wp-admin/post-new.php?post_type=release_link">links de lançamento</ulink>. Uma vez adicionados ao banco de dados,links irão aparecer nos lugares apropriados automaticamente.

source: Download mirrors
pt_br: Espelhos de download

source: The download link lists are created automatically from URL templates saved in the database. To manage release mirrors on the download lists, go to <ulink url="https://xubuntu.org/wp-admin/edit.php?post_type=download_mirror">DL Mirrors</ulink>. On the edit pages you are able to make download mirrors active or inactive (respectively visible and hidden on the frontend). You can also change which download links are shown on the default listing; set the mirror as a <emphasis>main download mirror</emphasis> if you want it to be visible directly.
pt_br: As listas de links de download são criadas automaticamente a partir dos modelos de URL salvos no banco de dados. Para gerenciar os mirrors de lançamento nas listas de download,vá para <ulink url="https://xubuntu.org/wp-admin/edit.php?post_type=download_mirror">Mirrors DL</ulink>. Na edição de páginas você é capaz de tornar mirrors de download ativos ou inativos (respectivamente visíveis e ocultos no front-end). Poderá também alterar quais links de download são exibidos na listagem padrão,configure o mirror como um <emphasis>mirror de download principal</emphasis> se quiser que ele seja visível diretamente.

source: Would you rather read this documentation in PDF?
pt_br: Você prefere ler esta documentação em PDF?

source: Select your preferred paper size: <_:ulink-1/> or <_:ulink-2/>.
pt_br: Selecione seu tamanho de papal preferido: <_:ulink-1/> ou <_:ulink-2/>.

source: The contributors to this translation of the documentation are:
pt_br: As seguintes pessoas contribuíram para a tradução deste documento:

source: Translator data could not be acquired, please see <_:ulink-1/>.
pt_br: Não foi possível adquirir os dados do tradutor, por favor, consulte<_:ulink-1/>.
